-- 地图配置
scene_config = {
	begin_pos = { x = -1024.0, z = -1024.0 },
	size = { x = 3072.0, z = 3072.0 },
	born_pos = { x = 1023.536, y = 1086.578, z = 890.843 },
	born_rot = { x = 0.000, y = 250.450, z = 0.000 },
	die_y = -20,
	vision_anchor = { x = -2000.0, z = -2000.0 }
}

-- 所有的区块
blocks = { 6001, 6002, 6003, 6004, 6005, 6006, 6007, 6008, 6009 }

-- 所有的区块范围坐标
block_rects = {
	{ min = { x = 0.0, z = 0.0 }, max = { x = 1024.0, z = 1024.0 } },
	{ min = { x = 1024.0, z = 0.0 }, max = { x = 2048.0, z = 1024.0 } },
	{ min = { x = 1024.0, z = 1024.0 }, max = { x = 2048.0, z = 2048.0 } },
	{ min = { x = 0.0, z = 1024.0 }, max = { x = 1024.0, z = 2048.0 } },
	{ min = { x = 1024.0, z = -1024.0 }, max = { x = 2048.0, z = 0.0 } },
	{ min = { x = 0.0, z = -1024.0 }, max = { x = 1024.0, z = 0.0 } },
	{ min = { x = -1024.0, z = -1024.0 }, max = { x = 0.0, z = 0.0 } },
	{ min = { x = -1024.0, z = 0.0 }, max = { x = 0.0, z = 1024.0 } },
	{ min = { x = -1024.0, z = 1024.0 }, max = { x = 0.0, z = 2048.0 } }
}

-- Dummy Points
dummy_points = { "dummy_points" }

-- Routes
routes_config = { "routes" }