-- 基础信息
local base_info = {
	group_id = 166001429
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 429001, monster_id = 28050301, pos = { x = 577.630, y = 709.727, z = 308.016 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, drop_tag = "采集动物", area_id = 300 },
	{ config_id = 429002, monster_id = 28050301, pos = { x = 703.248, y = 708.139, z = 293.507 }, rot = { x = 0.000, y = 263.933, z = 0.000 }, level = 36, drop_tag = "采集动物", area_id = 300 },
	{ config_id = 429005, monster_id = 28010202, pos = { x = 576.339, y = 707.941, z = 305.763 }, rot = { x = 0.000, y = 289.446, z = 0.000 }, level = 36, drop_tag = "采集动物", area_id = 300 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 429003, gadget_id = 70210101, pos = { x = 560.678, y = 710.748, z = 316.123 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物璃月", persistent = true, area_id = 300 },
	{ config_id = 429004, gadget_id = 70210101, pos = { x = 562.887, y = 710.172, z = 315.643 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜破损璃月", persistent = true, area_id = 300 },
	{ config_id = 429006, gadget_id = 70210101, pos = { x = 511.333, y = 707.551, z = 297.437 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜破损璃月", persistent = true, area_id = 300 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 429001, 429002, 429005 },
		gadgets = { 429003, 429004, 429006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================