-- 基础信息
local base_info = {
	group_id = 166001627
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 627001, gadget_id = 70500000, pos = { x = 825.287, y = 707.635, z = 492.504 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627002, gadget_id = 70500000, pos = { x = 827.588, y = 707.943, z = 492.150 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627003, gadget_id = 70500000, pos = { x = 773.142, y = 709.306, z = 432.497 }, rot = { x = 9.205, y = 1.188, z = 14.672 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627004, gadget_id = 70500000, pos = { x = 784.451, y = 710.004, z = 508.442 }, rot = { x = 0.000, y = 106.211, z = 0.000 }, level = 36, point_type = 1010, area_id = 300 },
	{ config_id = 627005, gadget_id = 70500000, pos = { x = 780.396, y = 709.458, z = 503.519 }, rot = { x = 0.000, y = 336.819, z = 0.000 }, level = 36, point_type = 1010, area_id = 300 },
	{ config_id = 627006, gadget_id = 70500000, pos = { x = 781.112, y = 709.578, z = 507.807 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, point_type = 1010, area_id = 300 },
	{ config_id = 627007, gadget_id = 70500000, pos = { x = 786.603, y = 709.480, z = 507.153 }, rot = { x = 0.000, y = 322.468, z = 0.000 }, level = 36, point_type = 1003, area_id = 300 },
	{ config_id = 627008, gadget_id = 70500000, pos = { x = 782.496, y = 709.680, z = 507.853 }, rot = { x = 349.319, y = 341.587, z = 3.531 }, level = 36, point_type = 1003, area_id = 300 },
	{ config_id = 627009, gadget_id = 70500000, pos = { x = 802.111, y = 707.348, z = 501.587 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, point_type = 2004, area_id = 300 },
	{ config_id = 627010, gadget_id = 70500000, pos = { x = 838.639, y = 706.922, z = 464.454 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, point_type = 2004, area_id = 300 },
	{ config_id = 627011, gadget_id = 70500000, pos = { x = 760.332, y = 708.507, z = 473.239 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, point_type = 2004, area_id = 300 },
	{ config_id = 627012, gadget_id = 70500000, pos = { x = 800.187, y = 719.787, z = 422.186 }, rot = { x = 21.964, y = 345.151, z = 21.594 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627013, gadget_id = 70500000, pos = { x = 799.505, y = 719.698, z = 421.471 }, rot = { x = 18.208, y = 237.125, z = 335.967 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627014, gadget_id = 70500000, pos = { x = 850.461, y = 732.914, z = 432.540 }, rot = { x = 21.964, y = 345.151, z = 21.594 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627015, gadget_id = 70500000, pos = { x = 858.637, y = 735.997, z = 431.766 }, rot = { x = 21.228, y = 288.603, z = 7.830 }, level = 36, point_type = 2004, area_id = 300 },
	{ config_id = 627016, gadget_id = 70500000, pos = { x = 866.549, y = 742.320, z = 462.598 }, rot = { x = 346.909, y = 32.412, z = 11.722 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627017, gadget_id = 70500000, pos = { x = 783.407, y = 752.653, z = 518.118 }, rot = { x = 352.525, y = 32.111, z = 342.245 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627018, gadget_id = 70500000, pos = { x = 783.639, y = 763.108, z = 431.440 }, rot = { x = 0.804, y = 202.203, z = 350.475 }, level = 36, point_type = 2044, area_id = 300 },
	{ config_id = 627019, gadget_id = 70500000, pos = { x = 767.976, y = 711.118, z = 485.468 }, rot = { x = 18.208, y = 237.125, z = 319.546 }, level = 36, point_type = 2044, area_id = 300 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 627001, 627002, 627003, 627004, 627005, 627006, 627007, 627008, 627009, 627010, 627011, 627012, 627013, 627014, 627015, 627016, 627017, 627018, 627019 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================