-- 基础信息
local base_info = {
	group_id = 166001505
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 505001, gadget_id = 70290353, pos = { x = 445.278, y = 656.058, z = 360.429 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505002, gadget_id = 70290353, pos = { x = 416.523, y = 654.304, z = 402.064 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505003, gadget_id = 70290353, pos = { x = 412.588, y = 650.991, z = 437.879 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505004, gadget_id = 70290353, pos = { x = 365.097, y = 662.281, z = 444.905 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505005, gadget_id = 70290353, pos = { x = 375.962, y = 659.016, z = 427.476 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505006, gadget_id = 70290353, pos = { x = 344.292, y = 670.951, z = 358.509 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505007, gadget_id = 70290353, pos = { x = 384.649, y = 664.165, z = 344.720 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505008, gadget_id = 70290353, pos = { x = 451.691, y = 654.456, z = 384.157 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505009, gadget_id = 70290353, pos = { x = 331.724, y = 677.414, z = 396.064 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 },
	{ config_id = 505010, gadget_id = 70290353, pos = { x = 376.903, y = 657.693, z = 475.616 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 36, persistent = true, area_id = 300 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 505001, 505002, 505003, 505004, 505005, 505006, 505007, 505008, 505009, 505010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================