-- 基础信息
local base_info = {
	group_id = 133308440
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 440001, gadget_id = 70310006, pos = { x = -2389.848, y = 128.030, z = 4493.850 }, rot = { x = 7.874, y = 359.448, z = 351.988 }, level = 32, area_id = 26 },
	{ config_id = 440002, gadget_id = 70710352, pos = { x = -2391.019, y = 129.404, z = 4491.782 }, rot = { x = 0.000, y = 45.555, z = 0.000 }, level = 32, area_id = 26 },
	{ config_id = 440003, gadget_id = 70210101, pos = { x = -2391.019, y = 129.404, z = 4491.782 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 26 },
	{ config_id = 440004, gadget_id = 70710037, pos = { x = -2390.682, y = 128.121, z = 4494.276 }, rot = { x = 0.000, y = 330.060, z = 0.000 }, level = 32, area_id = 26 },
	{ config_id = 440005, gadget_id = 70710037, pos = { x = -2390.657, y = 128.139, z = 4494.068 }, rot = { x = 0.000, y = 9.531, z = 0.000 }, level = 32, area_id = 26 },
	{ config_id = 440007, gadget_id = 70210101, pos = { x = -2406.066, y = 138.113, z = 4506.887 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 26 },
	{ config_id = 440008, gadget_id = 70210101, pos = { x = -2430.587, y = 150.178, z = 4512.189 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 26 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	gadgets = {
		{ config_id = 440006, gadget_id = 70710559, pos = { x = -2392.771, y = 127.610, z = 4492.706 }, rot = { x = 18.456, y = 357.347, z = 343.775 }, level = 32, area_id = 26 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 440001, 440002, 440003, 440004, 440005, 440007, 440008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================