-- 基础信息
local base_info = {
	group_id = 133106016
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 16001, gadget_id = 70500000, pos = { x = -980.788, y = 232.879, z = 1268.385 }, rot = { x = 0.000, y = 293.315, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16002, gadget_id = 70500000, pos = { x = -835.362, y = 156.133, z = 1180.972 }, rot = { x = 0.000, y = 33.787, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16003, gadget_id = 70500000, pos = { x = -780.481, y = 197.601, z = 1197.367 }, rot = { x = 0.000, y = 144.295, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16004, gadget_id = 70500000, pos = { x = -945.820, y = 221.127, z = 1040.200 }, rot = { x = 0.000, y = 204.258, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16005, gadget_id = 70500000, pos = { x = -958.416, y = 214.547, z = 1199.261 }, rot = { x = 0.000, y = 5.449, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16006, gadget_id = 70500000, pos = { x = -881.397, y = 194.009, z = 1122.517 }, rot = { x = 0.000, y = 212.181, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 16007, gadget_id = 70500000, pos = { x = -1011.747, y = 262.387, z = 1104.592 }, rot = { x = 0.000, y = 312.381, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 16008, gadget_id = 70500000, pos = { x = -943.526, y = 227.231, z = 1093.818 }, rot = { x = 0.000, y = 295.350, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 16009, gadget_id = 70500000, pos = { x = -904.713, y = 155.248, z = 1247.996 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 16010, gadget_id = 70500000, pos = { x = -816.867, y = 172.198, z = 1057.460 }, rot = { x = 0.000, y = 319.512, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16011, gadget_id = 70500000, pos = { x = -785.771, y = 155.460, z = 1267.656 }, rot = { x = 0.000, y = 122.352, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 16012, gadget_id = 70500000, pos = { x = -925.900, y = 167.205, z = 1197.453 }, rot = { x = 0.000, y = 177.720, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16013, gadget_id = 70500000, pos = { x = -1018.314, y = 237.914, z = 1228.601 }, rot = { x = 0.000, y = 5.595, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 16014, gadget_id = 70290001, pos = { x = -840.811, y = 174.311, z = 1068.445 }, rot = { x = 0.000, y = 262.900, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 16015, gadget_id = 70500000, pos = { x = -841.211, y = 174.880, z = 1068.412 }, rot = { x = 0.000, y = 262.907, z = 0.000 }, level = 32, point_type = 3002, owner = 16014, area_id = 8 },
	{ config_id = 16016, gadget_id = 70500000, pos = { x = -840.410, y = 175.166, z = 1068.429 }, rot = { x = 0.000, y = 262.907, z = 0.000 }, level = 32, point_type = 3002, owner = 16014, area_id = 8 },
	{ config_id = 16017, gadget_id = 70500000, pos = { x = -840.742, y = 175.578, z = 1068.723 }, rot = { x = 0.000, y = 262.907, z = 0.000 }, level = 32, point_type = 3002, owner = 16014, area_id = 8 },
	{ config_id = 16018, gadget_id = 70290001, pos = { x = -845.961, y = 201.892, z = 1030.540 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 16019, gadget_id = 70500000, pos = { x = -845.944, y = 202.461, z = 1030.941 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3002, owner = 16018, area_id = 8 },
	{ config_id = 16020, gadget_id = 70500000, pos = { x = -846.026, y = 202.747, z = 1030.144 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3002, owner = 16018, area_id = 8 },
	{ config_id = 16021, gadget_id = 70500000, pos = { x = -845.693, y = 203.159, z = 1030.437 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3002, owner = 16018, area_id = 8 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 16001, 16002, 16003, 16004, 16005, 16006, 16007, 16008, 16009, 16010, 16011, 16012, 16013, 16014, 16015, 16016, 16017, 16018, 16019, 16020, 16021 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================