-- 基础信息
local base_info = {
	group_id = 133102153
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 153001, gadget_id = 70290001, pos = { x = 1486.812, y = 201.493, z = 800.702 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, area_id = 5 },
	{ config_id = 153002, gadget_id = 70500000, pos = { x = 1486.829, y = 202.062, z = 801.103 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, point_type = 3002, owner = 153001, area_id = 5 },
	{ config_id = 153003, gadget_id = 70500000, pos = { x = 1486.747, y = 202.348, z = 800.306 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, point_type = 3002, owner = 153001, area_id = 5 },
	{ config_id = 153004, gadget_id = 70500000, pos = { x = 1487.080, y = 202.760, z = 800.599 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, point_type = 3002, owner = 153001, area_id = 5 },
	{ config_id = 153005, gadget_id = 70500000, pos = { x = 1485.389, y = 201.266, z = 798.833 }, rot = { x = 349.548, y = 333.576, z = 24.859 }, level = 18, point_type = 3002, area_id = 5 },
	{ config_id = 153006, gadget_id = 70500000, pos = { x = 1534.355, y = 205.961, z = 830.034 }, rot = { x = 0.000, y = 102.812, z = 0.000 }, level = 18, point_type = 2001, area_id = 5 },
	{ config_id = 153007, gadget_id = 70500000, pos = { x = 1528.537, y = 228.554, z = 794.300 }, rot = { x = 0.000, y = 335.635, z = 0.000 }, level = 18, point_type = 2004, area_id = 5 },
	{ config_id = 153008, gadget_id = 70500000, pos = { x = 1516.337, y = 205.578, z = 813.290 }, rot = { x = 346.783, y = 45.353, z = 345.875 }, level = 18, point_type = 2030, area_id = 5 },
	{ config_id = 153009, gadget_id = 70500000, pos = { x = 1281.642, y = 201.666, z = 993.027 }, rot = { x = 0.000, y = 25.411, z = 0.000 }, level = 19, point_type = 2001, area_id = 6 },
	{ config_id = 153010, gadget_id = 70500000, pos = { x = 1370.125, y = 200.262, z = 948.495 }, rot = { x = 0.000, y = 29.685, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153011, gadget_id = 70500000, pos = { x = 1370.184, y = 200.231, z = 943.184 }, rot = { x = 0.000, y = 187.857, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153012, gadget_id = 70500000, pos = { x = 1378.813, y = 200.271, z = 930.021 }, rot = { x = 0.000, y = 11.259, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153013, gadget_id = 70500000, pos = { x = 1299.552, y = 200.100, z = 919.424 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153014, gadget_id = 70500000, pos = { x = 1321.634, y = 200.000, z = 933.055 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153015, gadget_id = 70500000, pos = { x = 1339.496, y = 200.000, z = 915.766 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153016, gadget_id = 70500000, pos = { x = 1362.202, y = 200.113, z = 928.383 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153017, gadget_id = 70500000, pos = { x = 1332.056, y = 200.214, z = 945.194 }, rot = { x = 0.000, y = 134.359, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153018, gadget_id = 70500000, pos = { x = 1397.544, y = 199.976, z = 937.382 }, rot = { x = 0.000, y = 134.359, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153019, gadget_id = 70500000, pos = { x = 1343.224, y = 200.017, z = 981.108 }, rot = { x = 0.000, y = 82.735, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153020, gadget_id = 70500000, pos = { x = 1336.858, y = 200.122, z = 1007.055 }, rot = { x = 0.000, y = 82.735, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153021, gadget_id = 70500000, pos = { x = 1305.881, y = 200.000, z = 981.402 }, rot = { x = 0.000, y = 82.735, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153022, gadget_id = 70500000, pos = { x = 1305.614, y = 200.003, z = 1000.238 }, rot = { x = 0.000, y = 82.735, z = 0.000 }, level = 19, point_type = 2005, area_id = 6 },
	{ config_id = 153023, gadget_id = 70500000, pos = { x = 1324.651, y = 200.189, z = 1013.975 }, rot = { x = 0.000, y = 82.735, z = 0.000 }, level = 19, point_type = 2005, area_id = 5 },
	{ config_id = 153024, gadget_id = 70500000, pos = { x = 1280.282, y = 200.196, z = 974.150 }, rot = { x = 0.000, y = 59.856, z = 0.000 }, level = 19, point_type = 2005, area_id = 6 },
	{ config_id = 153025, gadget_id = 70500000, pos = { x = 1293.748, y = 200.000, z = 987.616 }, rot = { x = 0.000, y = 59.856, z = 0.000 }, level = 19, point_type = 2005, area_id = 6 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 153001, 153002, 153003, 153004, 153005, 153006, 153007, 153008, 153009, 153010, 153011, 153012, 153013, 153014, 153015, 153016, 153017, 153018, 153019, 153020, 153021, 153022, 153023, 153024, 153025 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================