-- 基础信息
local base_info = {
	group_id = 133101905
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 905001, gadget_id = 70500000, pos = { x = 1152.428, y = 358.591, z = 1643.836 }, rot = { x = 22.112, y = 233.590, z = 351.369 }, level = 24, point_type = 2015, area_id = 6 },
	{ config_id = 905002, gadget_id = 70500000, pos = { x = 1152.391, y = 358.717, z = 1643.733 }, rot = { x = 26.837, y = 213.975, z = 1.599 }, level = 24, point_type = 2015, area_id = 6 },
	{ config_id = 905003, gadget_id = 70500000, pos = { x = 1152.738, y = 358.464, z = 1643.644 }, rot = { x = 0.000, y = 112.787, z = 0.000 }, level = 24, point_type = 2005, area_id = 6 },
	{ config_id = 905004, gadget_id = 70220026, pos = { x = 1198.873, y = 351.658, z = 1525.839 }, rot = { x = 0.000, y = 284.696, z = 0.000 }, level = 24, area_id = 6 },
	{ config_id = 905005, gadget_id = 70500000, pos = { x = 1198.353, y = 351.628, z = 1524.472 }, rot = { x = 0.000, y = 89.579, z = 0.000 }, level = 24, point_type = 2009, area_id = 6 },
	{ config_id = 905007, gadget_id = 70500000, pos = { x = 1198.447, y = 351.641, z = 1525.230 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 24, point_type = 2009, area_id = 6 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { },
		gadgets = { 905001, 905002, 905003, 905004, 905005, 905007 },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================