-- 基础信息
local base_info = {
	group_id = 133104280
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 280001, monster_id = 21010501, pos = { x = 103.297, y = 241.280, z = 899.080 }, rot = { x = 0.301, y = 238.406, z = 346.576 }, level = 19, drop_tag = "远程丘丘人", disableWander = true, pose_id = 9003, area_id = 6 },
	{ config_id = 280002, monster_id = 21010201, pos = { x = 100.222, y = 241.251, z = 900.673 }, rot = { x = 357.963, y = 168.504, z = 354.420 }, level = 19, drop_tag = "丘丘人", disableWander = true, pose_id = 9003, area_id = 6 },
	{ config_id = 280003, monster_id = 21010201, pos = { x = 100.509, y = 240.778, z = 896.935 }, rot = { x = 12.280, y = 351.425, z = 5.492 }, level = 19, drop_tag = "丘丘人", disableWander = true, pose_id = 9003, area_id = 6 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 280004, gadget_id = 70220005, pos = { x = 102.349, y = 241.546, z = 902.087 }, rot = { x = 2.438, y = 0.432, z = 2.062 }, level = 19, area_id = 6 },
	{ config_id = 280005, gadget_id = 70220005, pos = { x = 97.980, y = 240.517, z = 896.685 }, rot = { x = 8.634, y = 359.912, z = 3.046 }, level = 19, area_id = 6 },
	{ config_id = 280006, gadget_id = 70220013, pos = { x = 96.771, y = 241.063, z = 901.451 }, rot = { x = 359.195, y = 359.033, z = 7.487 }, level = 19, area_id = 6 },
	{ config_id = 280007, gadget_id = 70310004, pos = { x = 101.170, y = 241.141, z = 899.031 }, rot = { x = 9.454, y = 358.630, z = 5.216 }, level = 19, area_id = 6 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 280001, 280002, 280003 },
		gadgets = { 280004, 280005, 280006, 280007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================