-- 基础信息
local base_info = {
	group_id = 133103805
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 805001, monster_id = 28020301, pos = { x = 533.675, y = 288.755, z = 1495.180 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 24, drop_tag = "走兽", area_id = 6 },
	{ config_id = 805005, monster_id = 28020301, pos = { x = 491.157, y = 295.322, z = 1507.351 }, rot = { x = 0.000, y = 77.939, z = 0.000 }, level = 24, drop_tag = "走兽", disableWander = true, area_id = 6 },
	{ config_id = 805006, monster_id = 28020301, pos = { x = 496.738, y = 293.472, z = 1496.229 }, rot = { x = 0.000, y = 77.939, z = 0.000 }, level = 24, drop_tag = "走兽", area_id = 6 },
	{ config_id = 805007, monster_id = 28020404, pos = { x = 438.500, y = 279.242, z = 1243.169 }, rot = { x = 0.000, y = 243.055, z = 0.000 }, level = 24, drop_tag = "走兽", pose_id = 1, area_id = 6 },
	{ config_id = 805008, monster_id = 28020502, pos = { x = 456.601, y = 280.191, z = 1229.883 }, rot = { x = 0.000, y = 337.901, z = 0.000 }, level = 24, drop_tag = "走兽", pose_id = 1, area_id = 6 },
	{ config_id = 805009, monster_id = 28020402, pos = { x = 448.205, y = 277.634, z = 1233.973 }, rot = { x = 0.000, y = 214.200, z = 0.000 }, level = 24, drop_tag = "走兽", pose_id = 1, area_id = 6 },
	{ config_id = 805010, monster_id = 28020505, pos = { x = 359.308, y = 291.144, z = 1212.811 }, rot = { x = 0.000, y = 204.280, z = 0.000 }, level = 24, drop_tag = "走兽", pose_id = 1, area_id = 6 },
	{ config_id = 805011, monster_id = 28030401, pos = { x = 331.473, y = 264.351, z = 1128.173 }, rot = { x = 0.000, y = 44.071, z = 0.000 }, level = 19, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 805012, monster_id = 28030401, pos = { x = 334.490, y = 263.829, z = 1126.031 }, rot = { x = 0.000, y = 44.071, z = 0.000 }, level = 19, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 805013, monster_id = 28030401, pos = { x = 332.011, y = 264.178, z = 1126.492 }, rot = { x = 0.000, y = 44.071, z = 0.000 }, level = 19, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 805014, monster_id = 28020504, pos = { x = 353.138, y = 260.511, z = 1356.976 }, rot = { x = 0.000, y = 33.010, z = 0.000 }, level = 24, drop_tag = "走兽", pose_id = 1, area_id = 6 },
	{ config_id = 805015, monster_id = 28020505, pos = { x = 396.137, y = 293.485, z = 1531.358 }, rot = { x = 0.000, y = 320.428, z = 0.000 }, level = 24, drop_tag = "走兽", pose_id = 1, area_id = 6 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 805001, 805005, 805006, 805007, 805008, 805009, 805010, 805011, 805012, 805013, 805014, 805015 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================