-- 基础信息
local base_info = {
	group_id = 133103367
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 367001, monster_id = 28030501, pos = { x = 32.154, y = 256.000, z = 1562.545 }, rot = { x = 0.000, y = 209.702, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367002, monster_id = 28030501, pos = { x = 26.095, y = 256.000, z = 1575.276 }, rot = { x = 0.000, y = 55.077, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367003, monster_id = 28030501, pos = { x = 85.115, y = 256.000, z = 1605.076 }, rot = { x = 0.000, y = 321.375, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367004, monster_id = 28030501, pos = { x = 83.706, y = 256.000, z = 1629.789 }, rot = { x = 0.000, y = 274.031, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367005, monster_id = 28030501, pos = { x = 28.528, y = 256.000, z = 1572.994 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367006, monster_id = 28030501, pos = { x = 32.405, y = 256.000, z = 1644.563 }, rot = { x = 0.000, y = 65.622, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367007, monster_id = 28030501, pos = { x = 57.413, y = 256.000, z = 1576.931 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367008, monster_id = 28030502, pos = { x = 28.820, y = 256.000, z = 1576.507 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367009, monster_id = 28030502, pos = { x = 60.199, y = 256.000, z = 1579.964 }, rot = { x = 0.000, y = 302.095, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367010, monster_id = 28030502, pos = { x = 87.841, y = 256.000, z = 1628.008 }, rot = { x = 0.000, y = 261.748, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367011, monster_id = 28030502, pos = { x = 36.602, y = 256.000, z = 1644.967 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367012, monster_id = 28030502, pos = { x = 44.514, y = 256.000, z = 1629.834 }, rot = { x = 0.000, y = 47.356, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 6 },
	{ config_id = 367013, monster_id = 28030502, pos = { x = 82.482, y = 256.000, z = 1586.870 }, rot = { x = 0.000, y = 169.556, z = 0.000 }, level = 27, drop_tag = "鸟类", disableWander = true, pose_id = 2, area_id = 6 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 367001, 367002, 367003, 367004, 367005, 367006, 367007, 367008, 367009, 367010, 367011, 367012, 367013 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================