-- 基础信息
local base_info = {
	group_id = 133315110
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 110004, monster_id = 21010301, pos = { x = 426.226, y = 223.393, z = 2331.943 }, rot = { x = 0.000, y = 350.425, z = 0.000 }, level = 27, drop_tag = "丘丘人", disableWander = true, area_id = 20 },
	{ config_id = 110005, monster_id = 21010301, pos = { x = 428.636, y = 223.411, z = 2332.445 }, rot = { x = 0.000, y = 346.728, z = 0.000 }, level = 27, drop_tag = "丘丘人", disableWander = true, area_id = 20 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 110001, gadget_id = 70220026, pos = { x = 428.157, y = 223.392, z = 2324.887 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110002, gadget_id = 70210101, pos = { x = 428.511, y = 223.390, z = 2325.079 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 20 },
	{ config_id = 110003, gadget_id = 70210101, pos = { x = 426.167, y = 223.395, z = 2325.071 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 20 },
	{ config_id = 110006, gadget_id = 70220066, pos = { x = 426.423, y = 223.767, z = 2324.810 }, rot = { x = 84.877, y = 180.001, z = 226.830 }, level = 27, area_id = 20 },
	{ config_id = 110007, gadget_id = 70300086, pos = { x = 420.987, y = 223.748, z = 2334.087 }, rot = { x = 355.545, y = 5.874, z = 11.537 }, level = 27, area_id = 20 },
	{ config_id = 110008, gadget_id = 70300086, pos = { x = 426.870, y = 222.239, z = 2339.778 }, rot = { x = 24.635, y = 0.000, z = 343.253 }, level = 27, area_id = 20 },
	{ config_id = 110009, gadget_id = 70220013, pos = { x = 420.700, y = 224.277, z = 2337.551 }, rot = { x = 0.000, y = 18.462, z = 349.096 }, level = 27, area_id = 20 },
	{ config_id = 110010, gadget_id = 70220026, pos = { x = 421.142, y = 224.084, z = 2340.022 }, rot = { x = 0.004, y = 15.499, z = 340.303 }, level = 27, area_id = 20 },
	{ config_id = 110011, gadget_id = 70300087, pos = { x = 477.225, y = 228.178, z = 2328.361 }, rot = { x = 0.000, y = 113.567, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110012, gadget_id = 70220026, pos = { x = 470.694, y = 228.535, z = 2325.891 }, rot = { x = 0.000, y = 69.782, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110013, gadget_id = 70220026, pos = { x = 470.686, y = 229.542, z = 2325.866 }, rot = { x = 0.000, y = 35.984, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110014, gadget_id = 70220026, pos = { x = 467.320, y = 228.015, z = 2324.706 }, rot = { x = 0.000, y = 97.484, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110015, gadget_id = 70220065, pos = { x = 469.105, y = 228.067, z = 2325.655 }, rot = { x = 352.618, y = 69.782, z = 7.731 }, level = 27, area_id = 20 },
	{ config_id = 110016, gadget_id = 70300089, pos = { x = 479.817, y = 228.363, z = 2334.369 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110017, gadget_id = 70220066, pos = { x = 482.848, y = 228.923, z = 2326.573 }, rot = { x = 0.000, y = 69.782, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110018, gadget_id = 70220066, pos = { x = 483.510, y = 228.766, z = 2325.335 }, rot = { x = 0.000, y = 69.782, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110019, gadget_id = 70220013, pos = { x = 481.670, y = 228.947, z = 2329.586 }, rot = { x = 0.000, y = 334.439, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 110020, gadget_id = 70217020, pos = { x = 466.755, y = 227.618, z = 2330.690 }, rot = { x = 0.000, y = 345.693, z = 0.000 }, level = 26, drop_tag = "摩拉石箱须弥", isOneoff = true, persistent = true, explore = { name = "chest", exp = 4 }, area_id = 20 },
	{ config_id = 110021, gadget_id = 70300091, pos = { x = 485.792, y = 228.712, z = 2320.860 }, rot = { x = 349.335, y = 4.994, z = 17.057 }, level = 27, area_id = 20 },
	{ config_id = 110022, gadget_id = 70220013, pos = { x = 477.811, y = 226.254, z = 2317.384 }, rot = { x = 0.000, y = 9.572, z = 0.000 }, level = 27, area_id = 20 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 110004, 110005 },
		gadgets = { 110001, 110002, 110003, 110006, 110007, 110008, 110009, 110010, 110011, 110012, 110013, 110014, 110015, 110016, 110017, 110018, 110019, 110020, 110021, 110022 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================