-- 基础信息
local base_info = {
	group_id = 133003330
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1070, monster_id = 20010401, pos = { x = 2898.157, y = 226.634, z = -1109.218 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 19, drop_tag = "大史莱姆", area_id = 1 },
	{ config_id = 1071, monster_id = 20010301, pos = { x = 2897.610, y = 226.632, z = -1106.533 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 19, drop_tag = "史莱姆", area_id = 1 },
	{ config_id = 1072, monster_id = 20010301, pos = { x = 2896.950, y = 226.291, z = -1111.267 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 19, drop_tag = "史莱姆", area_id = 1 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3346, gadget_id = 70211101, pos = { x = 2815.217, y = 247.560, z = -1141.180 }, rot = { x = 353.485, y = 22.982, z = 1.538 }, level = 26, drop_tag = "解谜低级蒙德", isOneoff = true, persistent = true, explore = { name = "chest", exp = 1 }, area_id = 1 },
	{ config_id = 3348, gadget_id = 70220020, pos = { x = 2818.221, y = 247.934, z = -1141.331 }, rot = { x = 0.000, y = 85.245, z = 0.000 }, level = 30, area_id = 1 },
	{ config_id = 3349, gadget_id = 70220020, pos = { x = 2816.806, y = 248.371, z = -1139.000 }, rot = { x = 0.000, y = 200.520, z = 0.000 }, level = 30, area_id = 1 },
	{ config_id = 3350, gadget_id = 70220020, pos = { x = 2813.656, y = 247.884, z = -1139.347 }, rot = { x = 0.000, y = 147.166, z = 0.000 }, level = 30, area_id = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 1070, 1071, 1072 },
		gadgets = { 3346, 3348, 3349, 3350 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================