-- 基础信息
local base_info = {
	group_id = 133307379
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 379001, monster_id = 24040301, pos = { x = -1733.575, y = -13.673, z = 5835.525 }, rot = { x = 0.000, y = 73.520, z = 0.000 }, level = 32, drop_tag = "元能构装体", pose_id = 1004, area_id = 32 },
	{ config_id = 379002, monster_id = 26120201, pos = { x = -1697.335, y = -16.675, z = 5825.880 }, rot = { x = 0.000, y = 98.804, z = 0.000 }, level = 32, drop_tag = "大蕈兽", pose_id = 201, area_id = 32 },
	{ config_id = 379003, monster_id = 20010801, pos = { x = -1664.540, y = -21.200, z = 5844.426 }, rot = { x = 0.000, y = 254.831, z = 0.000 }, level = 32, drop_tag = "史莱姆", area_id = 32 },
	{ config_id = 379004, monster_id = 20010801, pos = { x = -1656.249, y = -21.200, z = 5844.054 }, rot = { x = 0.000, y = 253.629, z = 0.000 }, level = 32, drop_tag = "史莱姆", area_id = 32 },
	{ config_id = 379006, monster_id = 20010801, pos = { x = -1638.033, y = -21.200, z = 5837.288 }, rot = { x = 0.000, y = 176.050, z = 0.000 }, level = 32, drop_tag = "史莱姆", pose_id = 901, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 379005, gadget_id = 70330342, pos = { x = -1729.978, y = -13.086, z = 5834.382 }, rot = { x = 0.000, y = 53.478, z = 0.000 }, level = 26, drop_tag = "摩拉石箱须弥", isOneoff = true, persistent = true, explore = { name = "chest", exp = 4 }, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 379001, 379002, 379003, 379004, 379006 },
		gadgets = { 379005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================