-- 基础信息
local base_info = {
	group_id = 133308255
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 255001, gadget_id = 70710848, pos = { x = -1939.000, y = 292.684, z = 4358.683 }, rot = { x = 288.761, y = 0.705, z = 309.124 }, level = 1, area_id = 26 },
	{ config_id = 255002, gadget_id = 70710848, pos = { x = -1938.151, y = 292.645, z = 4358.825 }, rot = { x = 54.589, y = 59.268, z = 123.585 }, level = 1, area_id = 26 },
	{ config_id = 255003, gadget_id = 70710848, pos = { x = -1942.257, y = 293.032, z = 4359.417 }, rot = { x = 340.493, y = 39.868, z = 2.644 }, level = 1, area_id = 26 },
	{ config_id = 255004, gadget_id = 70710848, pos = { x = -1939.215, y = 292.882, z = 4358.138 }, rot = { x = 297.442, y = 130.261, z = 15.906 }, level = 1, area_id = 26 },
	{ config_id = 255005, gadget_id = 70710848, pos = { x = -1938.702, y = 292.655, z = 4358.828 }, rot = { x = 326.104, y = 252.032, z = 21.528 }, level = 1, area_id = 26 },
	{ config_id = 255006, gadget_id = 70710848, pos = { x = -1942.257, y = 293.032, z = 4359.417 }, rot = { x = 340.493, y = 39.868, z = 2.644 }, level = 1, area_id = 26 },
	{ config_id = 255007, gadget_id = 70710848, pos = { x = -1939.215, y = 292.882, z = 4358.138 }, rot = { x = 297.442, y = 130.261, z = 15.906 }, level = 1, area_id = 26 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 255001, 255002, 255003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { },
		gadgets = { 255004, 255006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 3,
		-- description = ,
		monsters = { },
		gadgets = { 255005, 255007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 4,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================