-- 基础信息
local base_info = {
	group_id = 133106098
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 98001, gadget_id = 70210101, pos = { x = -655.498, y = 222.012, z = 841.196 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用璃月", persistent = true, area_id = 8 },
	{ config_id = 98002, gadget_id = 70210101, pos = { x = -652.435, y = 222.031, z = 840.113 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用璃月", persistent = true, area_id = 8 },
	{ config_id = 98003, gadget_id = 70210101, pos = { x = -651.735, y = 222.053, z = 835.871 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜通用璃月", persistent = true, area_id = 8 },
	{ config_id = 98004, gadget_id = 70210101, pos = { x = -656.458, y = 222.177, z = 838.378 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文璃月", persistent = true, area_id = 8 },
	{ config_id = 98005, gadget_id = 70310009, pos = { x = -661.003, y = 221.121, z = 841.717 }, rot = { x = 8.642, y = 310.972, z = 359.032 }, level = 32, area_id = 8 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 98001, 98002, 98003, 98004, 98005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================