-- 基础信息
local base_info = {
	group_id = 133303175
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 175001, monster_id = 28020313, pos = { x = -1219.072, y = 233.512, z = 3165.969 }, rot = { x = 0.000, y = 155.542, z = 0.000 }, level = 30, drop_tag = "走兽", area_id = 23 },
	{ config_id = 175002, monster_id = 28020313, pos = { x = -1212.434, y = 236.870, z = 3162.335 }, rot = { x = 0.000, y = 219.056, z = 0.000 }, level = 30, drop_tag = "走兽", disableWander = true, area_id = 23 },
	{ config_id = 175003, monster_id = 28020313, pos = { x = -1212.001, y = 238.374, z = 3158.490 }, rot = { x = 0.000, y = 327.206, z = 0.000 }, level = 30, drop_tag = "走兽", disableWander = true, area_id = 23 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 175004, gadget_id = 70217020, pos = { x = -1227.453, y = 236.531, z = 3183.550 }, rot = { x = 0.000, y = 268.365, z = 0.000 }, level = 26, drop_tag = "摩拉石箱须弥", isOneoff = true, persistent = true, explore = { name = "chest", exp = 4 }, area_id = 23 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 175001, 175002, 175003 },
		gadgets = { 175004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================