-- 基础信息
local base_info = {
	group_id = 133301530
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 530001, monster_id = 25310201, pos = { x = -843.846, y = 239.375, z = 3555.613 }, rot = { x = 0.000, y = 198.135, z = 0.000 }, level = 33, drop_tag = "中级镀金旅团", disableWander = true, pose_id = 1, area_id = 23 },
	{ config_id = 530003, monster_id = 28030313, pos = { x = -838.906, y = 241.341, z = 3541.583 }, rot = { x = 0.000, y = 147.627, z = 0.000 }, level = 33, drop_tag = "鸟类", pose_id = 3, area_id = 23 },
	{ config_id = 530007, monster_id = 25310301, pos = { x = -843.290, y = 239.411, z = 3561.184 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 33, drop_tag = "中级镀金旅团", disableWander = true, area_id = 23 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 530002, gadget_id = 70220048, pos = { x = -831.056, y = 233.653, z = 3546.645 }, rot = { x = 0.000, y = 31.993, z = 0.000 }, level = 33, area_id = 23 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	gadgets = {
		{ config_id = 530004, gadget_id = 70290003, pos = { x = -839.268, y = 239.147, z = 3545.034 }, rot = { x = 0.000, y = 289.130, z = 0.000 }, level = 33, area_id = 23 },
		{ config_id = 530005, gadget_id = 70500000, pos = { x = -839.182, y = 239.250, z = 3545.004 }, rot = { x = 0.000, y = 289.131, z = 0.000 }, level = 33, point_type = 3003, owner = 530004, area_id = 23 },
		{ config_id = 530006, gadget_id = 70500000, pos = { x = -839.363, y = 239.250, z = 3545.067 }, rot = { x = 0.000, y = 289.131, z = 0.000 }, level = 33, point_type = 3003, owner = 530004, area_id = 23 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 530001, 530003, 530007 },
		gadgets = { 530002 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================