-- 基础信息
local base_info = {
	group_id = 133104911
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 911001, monster_id = 21010101, pos = { x = 779.876, y = 207.528, z = 272.135 }, rot = { x = 0.000, y = 200.450, z = 0.000 }, level = 26, drop_id = 1000100, disableWander = true, affix = { 1101 }, area_id = 9 },
	{ config_id = 911002, monster_id = 21010101, pos = { x = 778.416, y = 207.032, z = 273.632 }, rot = { x = 0.000, y = 166.180, z = 0.000 }, level = 26, drop_id = 1000100, disableWander = true, affix = { 1101 }, area_id = 9 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { 911001, 911002 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100,
		ban_refresh = true
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================