-- 基础信息
local base_info = {
	group_id = 133002141
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	-- 道具141001
	{ config_id = 141001, gadget_id = 70217013, pos = { x = 1804.004, y = 223.108, z = -404.226 }, rot = { x = 0.332, y = 351.051, z = 359.477 }, level = 6, chest_drop_id = 21920001, drop_count = 1, isOneoff = true, persistent = true, area_id = 3 },
	-- 道具141003
	{ config_id = 141002, gadget_id = 70217013, pos = { x = 1774.180, y = 220.097, z = -373.208 }, rot = { x = 359.629, y = 297.419, z = 0.716 }, level = 6, chest_drop_id = 21920002, drop_count = 1, isOneoff = true, persistent = true, area_id = 3 },
	-- 道具141019
	{ config_id = 141003, gadget_id = 70217013, pos = { x = 1751.687, y = 223.320, z = -413.011 }, rot = { x = 359.956, y = 0.000, z = 0.618 }, level = 6, chest_drop_id = 21920008, drop_count = 1, isOneoff = true, persistent = true, area_id = 3 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 141001, 141002, 141003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================