-- 基础信息
local base_info = {
	group_id = 133301562
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	monsters = {
		{ config_id = 562001, monster_id = 26090101, pos = { x = -240.587, y = 272.760, z = 3541.252 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562002, monster_id = 26090101, pos = { x = -212.002, y = 279.063, z = 3465.524 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562003, monster_id = 26090101, pos = { x = -208.160, y = 278.403, z = 3467.314 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562004, monster_id = 26090101, pos = { x = -234.820, y = 270.685, z = 3497.419 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562005, monster_id = 26090101, pos = { x = -180.557, y = 291.595, z = 3431.385 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562006, monster_id = 26090101, pos = { x = -205.022, y = 296.920, z = 3366.475 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562007, monster_id = 26090101, pos = { x = -206.689, y = 297.779, z = 3371.705 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562008, monster_id = 26090101, pos = { x = -241.658, y = 272.711, z = 3539.130 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562009, monster_id = 26090101, pos = { x = -210.053, y = 296.959, z = 3365.727 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 },
		{ config_id = 562010, monster_id = 26090101, pos = { x = -202.818, y = 319.257, z = 3641.922 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "蕈兽", pose_id = 101, area_id = 29 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================