-- 基础信息
local base_info = {
	group_id = 133002028
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 28001, gadget_id = 70500000, pos = { x = 1087.136, y = 402.332, z = -660.215 }, rot = { x = 0.000, y = 31.471, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28002, gadget_id = 70500000, pos = { x = 1190.479, y = 285.767, z = -517.318 }, rot = { x = 0.000, y = 60.445, z = 0.000 }, level = 30, point_type = 2007, area_id = 10 },
	{ config_id = 28003, gadget_id = 70500000, pos = { x = 1205.928, y = 388.197, z = -723.994 }, rot = { x = 0.000, y = 115.715, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28004, gadget_id = 70500000, pos = { x = 1172.762, y = 400.232, z = -707.092 }, rot = { x = 0.000, y = 84.285, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28005, gadget_id = 70500000, pos = { x = 1082.087, y = 413.708, z = -719.219 }, rot = { x = 0.000, y = 275.729, z = 0.000 }, level = 30, point_type = 2007, area_id = 10 },
	{ config_id = 28006, gadget_id = 70500000, pos = { x = 1235.617, y = 294.085, z = -556.969 }, rot = { x = 0.000, y = 248.524, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28007, gadget_id = 70500000, pos = { x = 1033.685, y = 392.096, z = -694.461 }, rot = { x = 0.000, y = 158.860, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28008, gadget_id = 70500000, pos = { x = 1235.402, y = 286.667, z = -547.881 }, rot = { x = 0.000, y = 57.678, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28009, gadget_id = 70500000, pos = { x = 1206.989, y = 299.225, z = -572.601 }, rot = { x = 0.000, y = 10.003, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28010, gadget_id = 70500000, pos = { x = 1049.079, y = 372.483, z = -622.608 }, rot = { x = 0.000, y = 324.604, z = 0.000 }, level = 30, point_type = 2007, area_id = 10 },
	{ config_id = 28011, gadget_id = 70500000, pos = { x = 1097.116, y = 411.645, z = -716.388 }, rot = { x = 0.000, y = 115.113, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28012, gadget_id = 70500000, pos = { x = 1157.053, y = 400.977, z = -724.811 }, rot = { x = 13.853, y = 81.930, z = 39.494 }, level = 30, point_type = 2007, area_id = 10 },
	{ config_id = 28013, gadget_id = 70500000, pos = { x = 1132.942, y = 416.721, z = -719.128 }, rot = { x = 0.000, y = 213.476, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28014, gadget_id = 70500000, pos = { x = 1031.754, y = 384.065, z = -670.144 }, rot = { x = 0.000, y = 212.434, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28015, gadget_id = 70500000, pos = { x = 1137.375, y = 295.951, z = -532.790 }, rot = { x = 0.000, y = 110.494, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 },
	{ config_id = 28016, gadget_id = 70500000, pos = { x = 1235.194, y = 384.056, z = -758.088 }, rot = { x = 0.000, y = 345.435, z = 0.000 }, level = 30, point_type = 2031, area_id = 10 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 28001, 28002, 28003, 28004, 28005, 28006, 28007, 28008, 28009, 28010, 28011, 28012, 28013, 28014, 28015, 28016 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================