-- 基础信息
local base_info = {
	group_id = 133309706
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 706001, monster_id = 21010501, pos = { x = -2770.546, y = 204.470, z = 5711.054 }, rot = { x = 0.000, y = 129.308, z = 0.000 }, level = 32, drop_tag = "远程丘丘人", disableWander = true, area_id = 27 },
	{ config_id = 706004, monster_id = 21010301, pos = { x = -2771.247, y = 202.956, z = 5701.912 }, rot = { x = 0.000, y = 334.083, z = 0.000 }, level = 32, drop_tag = "丘丘人", area_id = 27 },
	{ config_id = 706005, monster_id = 21020201, pos = { x = -2766.508, y = 206.126, z = 5714.958 }, rot = { x = 0.000, y = 123.386, z = 0.000 }, level = 32, drop_tag = "丘丘暴徒", pose_id = 401, area_id = 27 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 706002, gadget_id = 70330342, pos = { x = -2767.459, y = 207.384, z = 5718.593 }, rot = { x = 359.592, y = 359.974, z = 7.175 }, level = 26, drop_tag = "摩拉石箱须弥", isOneoff = true, persistent = true, explore = { name = "chest", exp = 4 }, area_id = 27 },
	{ config_id = 706006, gadget_id = 70300089, pos = { x = -2774.876, y = 207.985, z = 5723.418 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 27 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 706001, 706004, 706005 },
		gadgets = { 706002, 706006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================