-- 基础信息
local base_info = {
	group_id = 133106592
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 592001, monster_id = 25060101, pos = { x = -179.760, y = 288.228, z = 1495.573 }, rot = { x = 0.000, y = 301.679, z = 0.000 }, level = 36, drop_tag = "盗宝团", disableWander = true, pose_id = 4, area_id = 19 },
	{ config_id = 592002, monster_id = 25010201, pos = { x = -186.417, y = 288.482, z = 1497.579 }, rot = { x = 0.000, y = 73.446, z = 0.000 }, level = 36, drop_tag = "盗宝团", disableWander = true, pose_id = 4, area_id = 19 },
	{ config_id = 592003, monster_id = 25010501, pos = { x = -181.195, y = 288.634, z = 1501.234 }, rot = { x = 0.000, y = 192.043, z = 0.000 }, level = 36, drop_tag = "盗宝团", pose_id = 9009, area_id = 19 },
	{ config_id = 592004, monster_id = 25060101, pos = { x = -216.727, y = 280.600, z = 1355.436 }, rot = { x = 0.000, y = 232.350, z = 0.000 }, level = 36, drop_tag = "盗宝团", pose_id = 4, area_id = 19 },
	{ config_id = 592005, monster_id = 25010301, pos = { x = -217.290, y = 280.525, z = 1352.380 }, rot = { x = 0.000, y = 299.265, z = 0.000 }, level = 36, drop_tag = "盗宝团", pose_id = 9002, area_id = 19 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 592001, 592002, 592003, 592004, 592005 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================