-- 基础信息
local base_info = {
	group_id = 133103402
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 402004, monster_id = 28030502, pos = { x = 191.787, y = 185.300, z = 1342.214 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 24, drop_tag = "鸟类", pose_id = 901, area_id = 6 },
	{ config_id = 402010, monster_id = 28030501, pos = { x = 266.119, y = 185.300, z = 1370.586 }, rot = { x = 0.000, y = 342.590, z = 0.000 }, level = 24, drop_tag = "鸟类", pose_id = 2, area_id = 6 },
	{ config_id = 402023, monster_id = 28030502, pos = { x = 110.340, y = 185.300, z = 1301.304 }, rot = { x = 0.000, y = 240.000, z = 0.000 }, level = 24, drop_tag = "鸟类", area_id = 6 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	monsters = {
		{ config_id = 402025, monster_id = 28040101, pos = { x = 103.562, y = 185.300, z = 1319.147 }, rot = { x = 0.000, y = 80.000, z = 0.000 }, level = 24, drop_tag = "水族", area_id = 6 },
		{ config_id = 402026, monster_id = 28040101, pos = { x = 130.079, y = 185.300, z = 1338.342 }, rot = { x = 0.000, y = 314.220, z = 0.000 }, level = 24, drop_tag = "水族", area_id = 6 },
		{ config_id = 402029, monster_id = 28040101, pos = { x = 173.495, y = 185.300, z = 1342.271 }, rot = { x = 0.000, y = 26.010, z = 0.000 }, level = 24, drop_tag = "水族", area_id = 6 },
		{ config_id = 402033, monster_id = 28040101, pos = { x = 188.236, y = 185.300, z = 1305.768 }, rot = { x = 0.000, y = 46.870, z = 0.000 }, level = 24, drop_tag = "水族", area_id = 6 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 402004, 402010, 402023 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================