-- 基础信息
local base_info = {
	group_id = 133002036
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 36001, gadget_id = 70710342, pos = { x = 1325.206, y = 285.584, z = -440.901 }, rot = { x = 0.000, y = 296.281, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36002, gadget_id = 70710347, pos = { x = 1319.347, y = 285.351, z = -434.200 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36003, gadget_id = 70710352, pos = { x = 1319.103, y = 285.547, z = -432.774 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36004, gadget_id = 70710342, pos = { x = 1325.207, y = 285.803, z = -439.926 }, rot = { x = 0.000, y = 175.951, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36005, gadget_id = 70710342, pos = { x = 1307.238, y = 285.223, z = -452.826 }, rot = { x = 7.753, y = 0.000, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36006, gadget_id = 70300093, pos = { x = 1304.161, y = 285.153, z = -452.185 }, rot = { x = 25.560, y = 0.000, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36007, gadget_id = 70310015, pos = { x = 1279.576, y = 281.475, z = -435.825 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 10 },
	{ config_id = 36008, gadget_id = 70710346, pos = { x = 1324.168, y = 285.428, z = -440.497 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36009, gadget_id = 70710346, pos = { x = 1320.218, y = 285.696, z = -433.524 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 10 },
	{ config_id = 36010, gadget_id = 70310015, pos = { x = 1249.327, y = 268.390, z = -418.015 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 10 },
	{ config_id = 36011, gadget_id = 70310015, pos = { x = 1251.095, y = 248.772, z = -369.793 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 10 },
	{ config_id = 36017, gadget_id = 70310015, pos = { x = 1319.196, y = 285.022, z = -435.663 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 10 },
	{ config_id = 36018, gadget_id = 70310015, pos = { x = 1306.820, y = 284.397, z = -450.685 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 10 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 36001, 36002, 36003, 36004, 36005, 36006, 36007, 36008, 36009, 36010, 36011, 36017, 36018 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================