-- 基础信息
local base_info = {
	group_id = 133104269
}

-- DEFS_MISCS
local defs = {

        --对应GalleryID
        gallery_id = 11001,

        --GroupID
        group_id = 133104269,

        --挑战方式 0-指定ID的鱼钓起计数 1-记录指定ID的鱼最大连续成功数
        fishing_type = 0,

        --这个Group对应的挑战ID
        challenge_id = 111177,

        --本挑战中，算作计数目标的鱼IDs 鱼ID在FishData表
        target_fish_id = 
        {1,1001,3,1003,13,1013,14,1014,8,1008},

}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 269001, gadget_id = 70800039, pos = { x = 227.107, y = 200.000, z = 675.817 }, rot = { x = 0.000, y = 29.309, z = 0.000 }, level = 19, persistent = true, fishing_id = 10003, fishing_areas = { 300001 }, area_id = 9 }
}

-- 区域
regions = {
	{ config_id = 269002, shape = RegionShape.SPHERE, radius = 20, pos = { x = 233.009, y = 200.149, z = 683.542 }, area_id = 9 }
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 269001 },
		regions = { 269002 },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V2_1/FishingChallenge"