-- 基础信息
local base_info = {
	group_id = 133310374
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 374001, monster_id = 28050401, pos = { x = -2523.314, y = 199.934, z = 4491.758 }, rot = { x = 0.000, y = 340.427, z = 0.000 }, level = 32, drop_tag = "采集动物", pose_id = 101, area_id = 26, vision_level = VisionLevelType.VISION_LEVEL_NEARBY },
	{ config_id = 374002, monster_id = 28050401, pos = { x = -2507.012, y = 190.647, z = 4574.086 }, rot = { x = 0.000, y = 219.472, z = 0.000 }, level = 32, drop_tag = "采集动物", pose_id = 101, area_id = 26, vision_level = VisionLevelType.VISION_LEVEL_NEARBY }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 374001, 374002 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================