-- 基础信息
local base_info = {
	group_id = 133001050
}

-- DEFS_MISCS
local defs = {

        --对应GalleryID
        gallery_id = 11003,

        --GroupID
        group_id = 133001050,

        --挑战方式 0-指定ID的鱼钓起计数 1-记录指定ID的鱼最大连续成功数
        fishing_type = 1,

        --这个Group对应的挑战ID
        challenge_id = 111179,

        --本挑战中，算作计数目标的鱼IDs 鱼ID在FishData表
        target_fish_id = 
        {1,1001,4,1004,21,1000,16,1016,9,1009},

}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 50001, gadget_id = 70800039, pos = { x = 1700.327, y = 194.600, z = -1613.051 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, persistent = true, fishing_id = 10005, fishing_areas = { 300003 }, area_id = 2 }
}

-- 区域
regions = {
	{ config_id = 50002, shape = RegionShape.SPHERE, radius = 15, pos = { x = 1696.535, y = 195.364, z = -1602.328 }, area_id = 2 }
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 50001 },
		regions = { 50002 },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V2_1/FishingChallenge"