-- 基础信息
local base_info = {
	group_id = 133303544
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 544001, monster_id = 28050106, pos = { x = -1833.535, y = 133.152, z = 3515.185 }, rot = { x = 0.000, y = 289.395, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
	{ config_id = 544002, monster_id = 28050106, pos = { x = -1833.792, y = 133.307, z = 3517.310 }, rot = { x = 0.000, y = 282.181, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
	{ config_id = 544003, monster_id = 28050106, pos = { x = -1776.902, y = 134.252, z = 3503.259 }, rot = { x = 0.000, y = 241.266, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
	{ config_id = 544004, monster_id = 28050106, pos = { x = -1812.584, y = 122.319, z = 3491.340 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
	{ config_id = 544005, monster_id = 28050106, pos = { x = -1813.664, y = 121.818, z = 3489.109 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
	{ config_id = 544012, monster_id = 28050106, pos = { x = -1767.880, y = 115.717, z = 3456.811 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
	{ config_id = 544013, monster_id = 28050106, pos = { x = -1766.256, y = 115.918, z = 3454.218 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	monsters = {
		{ config_id = 544006, monster_id = 28050106, pos = { x = -1815.208, y = 115.448, z = 3461.766 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
		{ config_id = 544007, monster_id = 28050106, pos = { x = -1815.626, y = 115.629, z = 3459.118 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
		{ config_id = 544008, monster_id = 28050106, pos = { x = -1835.904, y = 110.791, z = 3453.684 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
		{ config_id = 544009, monster_id = 28050106, pos = { x = -1836.987, y = 111.069, z = 3452.523 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
		{ config_id = 544010, monster_id = 28050106, pos = { x = -1790.604, y = 98.098, z = 3439.524 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 },
		{ config_id = 544011, monster_id = 28050106, pos = { x = -1793.712, y = 98.104, z = 3437.933 }, rot = { x = 0.000, y = 267.933, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 23 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 544001, 544002, 544003, 544004, 544005, 544012, 544013 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================