-- 基础信息
local base_info = {
	group_id = 133209017
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 17002, monster_id = 20010801, pos = { x = -2617.099, y = 212.630, z = -4280.049 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 },
	{ config_id = 17003, monster_id = 20010801, pos = { x = -2605.649, y = 227.528, z = -4313.266 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 },
	{ config_id = 17004, monster_id = 20010801, pos = { x = -2599.694, y = 226.868, z = -4299.705 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 },
	{ config_id = 17005, monster_id = 22010401, pos = { x = -2623.090, y = 212.761, z = -4284.650 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 },
	{ config_id = 17006, monster_id = 22010201, pos = { x = -2616.983, y = 212.630, z = -4282.247 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 },
	{ config_id = 17007, monster_id = 20011501, pos = { x = -2601.750, y = 226.800, z = -4295.836 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 },
	{ config_id = 17008, monster_id = 20011501, pos = { x = -2599.459, y = 226.854, z = -4303.925 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 },
	{ config_id = 17009, monster_id = 20011501, pos = { x = -2594.885, y = 226.975, z = -4301.132 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_id = 1000100, area_id = 11 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 17001, gadget_id = 70500000, pos = { x = -2618.847, y = 212.372, z = -4294.272 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, point_type = 9158, area_id = 11 },
	{ config_id = 17010, gadget_id = 70500000, pos = { x = -2615.918, y = 212.294, z = -4286.108 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, point_type = 9158, area_id = 11 },
	{ config_id = 17011, gadget_id = 70500000, pos = { x = -2607.344, y = 226.173, z = -4305.139 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, point_type = 9158, area_id = 11 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = true
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 17002, 17003, 17004, 17006 },
		gadgets = { 17001, 17010, 17011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { 17005 },
		gadgets = { 17001, 17010, 17011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 3,
		-- description = ,
		monsters = { 17007, 17008, 17009 },
		gadgets = { 17001, 17010, 17011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================