-- 基础信息
local base_info = {
	group_id = 133222259
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 259001, monster_id = 25080301, pos = { x = -4273.019, y = 200.479, z = -4423.955 }, rot = { x = 4.811, y = 105.951, z = 5.937 }, level = 30, drop_tag = "浪人武士", pose_id = 1, area_id = 14 },
	{ config_id = 259004, monster_id = 25080101, pos = { x = -4267.244, y = 200.000, z = -4420.176 }, rot = { x = 0.000, y = 270.880, z = 0.000 }, level = 30, drop_tag = "浪人武士", disableWander = true, pose_id = 1006, area_id = 14 },
	{ config_id = 259005, monster_id = 25080101, pos = { x = -4270.996, y = 200.000, z = -4419.009 }, rot = { x = 0.000, y = 84.985, z = 0.000 }, level = 30, drop_tag = "浪人武士", disableWander = true, pose_id = 1006, area_id = 14 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	monsters = {
		{ config_id = 259002, monster_id = 25080301, pos = { x = -4220.478, y = 201.200, z = -4461.256 }, rot = { x = 357.594, y = 206.337, z = 358.810 }, level = 30, drop_tag = "浪人武士", pose_id = 1, area_id = 14 },
		{ config_id = 259003, monster_id = 25080301, pos = { x = -4146.139, y = 200.000, z = -4642.918 }, rot = { x = 0.127, y = 115.351, z = 5.983 }, level = 30, drop_tag = "浪人武士", pose_id = 1, area_id = 14 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 259001, 259004, 259005 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================