-- 基础信息
local base_info = {
	group_id = 133002131
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	-- 抓捕者
	{ config_id = 131001, gadget_id = 70800087, pos = { x = 1970.301, y = 210.728, z = -885.292 }, rot = { x = 0.000, y = 250.069, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131002, gadget_id = 44000253, pos = { x = 1947.936, y = 215.468, z = -890.922 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131003, gadget_id = 44000254, pos = { x = 1954.084, y = 213.309, z = -910.852 }, rot = { x = 0.000, y = 20.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131004, gadget_id = 44000253, pos = { x = 1949.030, y = 215.272, z = -889.033 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131005, gadget_id = 44000253, pos = { x = 1955.293, y = 213.830, z = -883.986 }, rot = { x = 0.000, y = 30.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131006, gadget_id = 44000253, pos = { x = 1954.365, y = 214.060, z = -885.591 }, rot = { x = 0.000, y = 30.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131007, gadget_id = 44000253, pos = { x = 1945.281, y = 215.979, z = -877.232 }, rot = { x = 0.000, y = 11.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131008, gadget_id = 44000253, pos = { x = 1937.047, y = 218.760, z = -884.547 }, rot = { x = 0.000, y = 55.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131009, gadget_id = 44000253, pos = { x = 1938.616, y = 218.702, z = -883.448 }, rot = { x = 0.000, y = 55.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131010, gadget_id = 44000253, pos = { x = 1940.123, y = 218.652, z = -882.393 }, rot = { x = 0.000, y = 55.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131011, gadget_id = 44000253, pos = { x = 1921.389, y = 224.902, z = -885.350 }, rot = { x = 0.000, y = 60.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131012, gadget_id = 44000253, pos = { x = 1923.109, y = 224.904, z = -884.571 }, rot = { x = 0.000, y = 60.000, z = 350.000 }, level = 1, area_id = 3 },
	{ config_id = 131013, gadget_id = 44000253, pos = { x = 1895.094, y = 226.937, z = -893.988 }, rot = { x = 0.000, y = 60.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131014, gadget_id = 44000253, pos = { x = 1897.416, y = 226.640, z = -893.302 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131015, gadget_id = 44000253, pos = { x = 1904.072, y = 228.453, z = -882.136 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131016, gadget_id = 44000253, pos = { x = 1904.072, y = 228.444, z = -884.064 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131017, gadget_id = 44000253, pos = { x = 1934.490, y = 221.063, z = -900.883 }, rot = { x = 0.000, y = 60.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131018, gadget_id = 44000253, pos = { x = 1932.386, y = 220.987, z = -899.668 }, rot = { x = 0.000, y = 90.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131019, gadget_id = 44000253, pos = { x = 1943.406, y = 221.189, z = -915.051 }, rot = { x = 0.000, y = 30.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131020, gadget_id = 44000253, pos = { x = 1943.963, y = 227.445, z = -913.310 }, rot = { x = 0.000, y = 30.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131021, gadget_id = 44000253, pos = { x = 1931.116, y = 231.873, z = -942.827 }, rot = { x = 0.000, y = 30.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131022, gadget_id = 44000253, pos = { x = 1925.228, y = 228.360, z = -944.429 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131023, gadget_id = 44000253, pos = { x = 1934.551, y = 224.424, z = -928.268 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131024, gadget_id = 44000253, pos = { x = 1932.730, y = 224.563, z = -928.420 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131025, gadget_id = 44000253, pos = { x = 1930.861, y = 224.650, z = -928.449 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131026, gadget_id = 44000253, pos = { x = 1913.817, y = 223.792, z = -932.908 }, rot = { x = 0.000, y = 160.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131027, gadget_id = 44000253, pos = { x = 1913.184, y = 223.737, z = -931.169 }, rot = { x = 0.000, y = 160.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131028, gadget_id = 44000254, pos = { x = 1950.833, y = 213.248, z = -909.494 }, rot = { x = 0.000, y = 90.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131029, gadget_id = 44000254, pos = { x = 1951.916, y = 213.368, z = -910.668 }, rot = { x = 0.000, y = 90.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131030, gadget_id = 44000254, pos = { x = 1948.387, y = 221.564, z = -909.437 }, rot = { x = 0.000, y = 0.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131031, gadget_id = 44000254, pos = { x = 1947.476, y = 221.510, z = -908.007 }, rot = { x = 0.000, y = 0.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131032, gadget_id = 44000254, pos = { x = 1943.292, y = 221.510, z = -906.631 }, rot = { x = 0.000, y = 0.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131033, gadget_id = 44000254, pos = { x = 1933.716, y = 221.899, z = -907.289 }, rot = { x = 0.000, y = 90.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131034, gadget_id = 44000254, pos = { x = 1920.218, y = 224.252, z = -942.402 }, rot = { x = 0.000, y = 90.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131035, gadget_id = 44000254, pos = { x = 1919.110, y = 224.261, z = -943.516 }, rot = { x = 0.000, y = 90.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131036, gadget_id = 44000254, pos = { x = 1905.184, y = 224.975, z = -924.975 }, rot = { x = 0.000, y = 0.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131037, gadget_id = 44000254, pos = { x = 1906.384, y = 225.058, z = -923.921 }, rot = { x = 0.000, y = 0.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131038, gadget_id = 44000254, pos = { x = 1897.002, y = 229.446, z = -890.096 }, rot = { x = 0.000, y = 0.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131039, gadget_id = 44000254, pos = { x = 1895.038, y = 229.179, z = -889.038 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131040, gadget_id = 44000254, pos = { x = 1890.429, y = 230.510, z = -917.320 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131041, gadget_id = 44000254, pos = { x = 1892.225, y = 230.821, z = -916.909 }, rot = { x = 0.000, y = 40.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131042, gadget_id = 44000254, pos = { x = 1903.099, y = 230.833, z = -917.728 }, rot = { x = 0.000, y = 60.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131043, gadget_id = 44000254, pos = { x = 1902.567, y = 230.380, z = -915.751 }, rot = { x = 0.000, y = 40.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131044, gadget_id = 44000254, pos = { x = 1941.364, y = 224.479, z = -937.974 }, rot = { x = 0.000, y = 40.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131045, gadget_id = 44000254, pos = { x = 1941.853, y = 224.429, z = -939.247 }, rot = { x = 0.000, y = 80.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131046, gadget_id = 44000254, pos = { x = 1937.381, y = 226.675, z = -905.204 }, rot = { x = 0.000, y = 40.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131047, gadget_id = 44000254, pos = { x = 1942.311, y = 227.274, z = -906.823 }, rot = { x = 0.000, y = 5.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131048, gadget_id = 44000254, pos = { x = 1909.102, y = 235.793, z = -940.462 }, rot = { x = 0.000, y = 0.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131049, gadget_id = 44000254, pos = { x = 1913.651, y = 221.940, z = -906.430 }, rot = { x = 0.000, y = 20.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131050, gadget_id = 44000254, pos = { x = 1958.877, y = 215.957, z = -912.474 }, rot = { x = 0.000, y = 20.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131051, gadget_id = 44000254, pos = { x = 1955.133, y = 216.996, z = -931.441 }, rot = { x = 0.000, y = 90.000, z = 90.000 }, level = 1, area_id = 3 },
	{ config_id = 131052, gadget_id = 44000253, pos = { x = 1929.416, y = 221.477, z = -906.448 }, rot = { x = 0.000, y = 160.000, z = 0.000 }, level = 1, area_id = 3 },
	-- 场景诱饵1
	{ config_id = 131053, gadget_id = 44000107, pos = { x = 1893.399, y = 226.671, z = -905.947 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵2
	{ config_id = 131054, gadget_id = 44000107, pos = { x = 1893.399, y = 226.550, z = -905.172 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵3
	{ config_id = 131055, gadget_id = 44000107, pos = { x = 1893.399, y = 226.452, z = -904.505 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 能量球物件
	{ config_id = 131056, gadget_id = 44000105, pos = { x = 1937.320, y = 223.844, z = -934.003 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景猎人引导1
	{ config_id = 131057, gadget_id = 44000106, pos = { x = 1959.564, y = 212.842, z = -886.583 }, rot = { x = 0.000, y = 234.265, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景猎人引导1
	{ config_id = 131058, gadget_id = 44000106, pos = { x = 1960.943, y = 212.822, z = -889.044 }, rot = { x = 0.000, y = 234.265, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景猎人引导1
	{ config_id = 131059, gadget_id = 44000106, pos = { x = 1962.451, y = 212.710, z = -891.316 }, rot = { x = 0.000, y = 234.265, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵3
	{ config_id = 131060, gadget_id = 44000107, pos = { x = 1893.399, y = 226.452, z = -904.505 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵3
	{ config_id = 131061, gadget_id = 44000107, pos = { x = 1893.399, y = 226.452, z = -904.505 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵3
	{ config_id = 131062, gadget_id = 44000107, pos = { x = 1893.399, y = 226.452, z = -904.505 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵3
	{ config_id = 131063, gadget_id = 44000107, pos = { x = 1893.399, y = 226.452, z = -904.505 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵3
	{ config_id = 131064, gadget_id = 44000107, pos = { x = 1893.399, y = 226.452, z = -904.505 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	-- 场景诱饵3
	{ config_id = 131065, gadget_id = 44000107, pos = { x = 1893.399, y = 226.452, z = -904.505 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 10, area_id = 3 },
	{ config_id = 131066, gadget_id = 70310057, pos = { x = 1943.964, y = 212.026, z = -919.885 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131068, gadget_id = 70310008, pos = { x = 1930.587, y = 224.182, z = -959.790 }, rot = { x = 0.000, y = 340.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131069, gadget_id = 70310008, pos = { x = 1928.867, y = 212.956, z = -959.300 }, rot = { x = 75.000, y = 180.000, z = 180.000 }, level = 1, area_id = 3 },
	{ config_id = 131083, gadget_id = 70800111, pos = { x = 1889.810, y = 247.490, z = -879.650 }, rot = { x = 0.000, y = 45.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131084, gadget_id = 70800078, pos = { x = 1887.581, y = 227.628, z = -903.268 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131085, gadget_id = 70800078, pos = { x = 1887.581, y = 227.628, z = -902.539 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 },
	{ config_id = 131086, gadget_id = 70800078, pos = { x = 1887.581, y = 227.628, z = -904.228 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 }
}

-- 区域
regions = {
	{ config_id = 131070, shape = RegionShape.SPHERE, radius = 200, pos = { x = 1898.680, y = 198.061, z = -913.018 }, area_id = 3 },
	{ config_id = 131071, shape = RegionShape.SPHERE, radius = 80, pos = { x = 1943.964, y = 212.026, z = -919.885 }, area_id = 3 },
	{ config_id = 131072, shape = RegionShape.SPHERE, radius = 85, pos = { x = 1934.972, y = 238.303, z = -914.742 }, area_id = 3 }
}

-- 触发器
triggers = {
}

-- 点位
points = {
	{ config_id = 131073, pos = { x = 1970.301, y = 210.728, z = -885.292 }, rot = { x = 0.000, y = 250.069, z = 0.000 }, area_id = 3 },
	{ config_id = 131074, pos = { x = 1959.564, y = 212.842, z = -886.583 }, rot = { x = 0.000, y = 234.265, z = 0.000 }, area_id = 3 },
	{ config_id = 131075, pos = { x = 1960.943, y = 212.822, z = -889.044 }, rot = { x = 0.000, y = 234.265, z = 0.000 }, area_id = 3 },
	{ config_id = 131076, pos = { x = 1962.451, y = 212.710, z = -891.316 }, rot = { x = 0.000, y = 234.265, z = 0.000 }, area_id = 3 },
	-- 能量随机1
	{ config_id = 131077, pos = { x = 1937.320, y = 223.844, z = -934.003 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, area_id = 3 },
	-- 能量随机2
	{ config_id = 131078, pos = { x = 1901.854, y = 229.854, z = -910.073 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, area_id = 3 },
	-- 能量随机3
	{ config_id = 131079, pos = { x = 1903.882, y = 228.436, z = -886.220 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, area_id = 3 },
	-- 能量随机4
	{ config_id = 131080, pos = { x = 1952.109, y = 211.359, z = -904.893 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, area_id = 3 },
	-- 能量随机5
	{ config_id = 131081, pos = { x = 1911.671, y = 231.925, z = -935.266 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, area_id = 3 },
	-- 能量随机6
	{ config_id = 131082, pos = { x = 1937.059, y = 218.759, z = -880.962 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, area_id = 3 }
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	gadgets = {
		{ config_id = 131067, gadget_id = 70310066, pos = { x = 1937.844, y = 246.043, z = -908.388 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, area_id = 3 }
	}
}

-- 视野组
sight_groups = {
	{ 131001, 131056, 131057, 131058, 131059 }
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 131001 },
		regions = { 131070, 131071, 131072 },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = 50%概率随机刷,
		monsters = { },
		gadgets = { 131002, 131003, 131004, 131005, 131006, 131007, 131008, 131009, 131010, 131011, 131012, 131013, 131014, 131015, 131016, 131017, 131018, 131019, 131020, 131021, 131022, 131023, 131024, 131025, 131026, 131027, 131028, 131029, 131030, 131031, 131032, 131033, 131034, 131035, 131036, 131037, 131038, 131039, 131040, 131041, 131042, 131043, 131044, 131045, 131046, 131047, 131048, 131049, 131050, 131051, 131052 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 3,
		-- description = 必刷,
		monsters = { },
		gadgets = { 131066, 131068, 131069, 131083 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 4,
		-- description = 先不刷了,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================