-- 基础信息
local base_info = {
	group_id = 133212532
}

-- DEFS_MISCS
local defs = {

        --对应GalleryID
        gallery_id = 11005,

        --GroupID
        group_id = 133212532,

        --本挑战中，算作计数目标的鱼IDs 鱼ID在FishData表
        target_fish_id = 1019

}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 532001, gadget_id = 70800040, pos = { x = -3533.332, y = 200.000, z = -2973.819 }, rot = { x = 0.000, y = 335.182, z = 0.000 }, level = 1, persistent = true, fishing_id = 10007, fishing_areas = { 300005 }, area_id = 12 }
}

-- 区域
regions = {
	{ config_id = 532002, shape = RegionShape.SPHERE, radius = 15, pos = { x = -3528.280, y = 200.000, z = -2986.551 }, area_id = 12 }
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 532001 },
		regions = { 532002 },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V2_1/FishingChallenge_Moonfin"