-- 基础信息
local base_info = {
	group_id = 133008692
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 692001, gadget_id = 70310022, pos = { x = 1206.831, y = 324.461, z = -1043.931 }, rot = { x = 340.487, y = 356.352, z = 17.561 }, level = 1, state = GadgetState.GearStart, area_id = 10 },
	{ config_id = 692002, gadget_id = 70310022, pos = { x = 1034.158, y = 316.077, z = -1125.478 }, rot = { x = 0.005, y = 0.152, z = 358.210 }, level = 1, state = GadgetState.GearStart, area_id = 10 },
	{ config_id = 692003, gadget_id = 70310015, pos = { x = 1003.903, y = 316.359, z = -1138.748 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 10 },
	{ config_id = 692004, gadget_id = 70310022, pos = { x = 1158.238, y = 304.000, z = -1125.681 }, rot = { x = 6.239, y = 359.902, z = 358.210 }, level = 1, state = GadgetState.GearStart, area_id = 10 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 692001, 692002, 692003, 692004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================