-- 基础信息
local base_info = {
	group_id = 133102158
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 158001, monster_id = 28010205, pos = { x = 1080.844, y = 200.085, z = 314.284 }, rot = { x = 350.377, y = 210.673, z = 355.951 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158002, monster_id = 28010205, pos = { x = 1080.570, y = 200.000, z = 319.804 }, rot = { x = 0.000, y = 253.368, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158003, monster_id = 28010205, pos = { x = 1050.023, y = 200.000, z = 328.898 }, rot = { x = 0.000, y = 211.913, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158004, monster_id = 28010205, pos = { x = 1055.796, y = 200.000, z = 334.214 }, rot = { x = 0.000, y = 177.034, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158005, monster_id = 28010205, pos = { x = 1178.044, y = 200.000, z = 459.286 }, rot = { x = 0.000, y = 115.140, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158006, monster_id = 28010205, pos = { x = 1163.594, y = 205.563, z = 276.870 }, rot = { x = 0.000, y = 76.638, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158007, monster_id = 28010205, pos = { x = 1181.654, y = 200.220, z = 265.513 }, rot = { x = 0.000, y = 121.724, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158008, monster_id = 28010205, pos = { x = 1182.570, y = 200.067, z = 322.491 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158009, monster_id = 28010301, pos = { x = 1194.804, y = 200.129, z = 345.010 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158010, monster_id = 28010205, pos = { x = 1134.688, y = 200.000, z = 269.612 }, rot = { x = 0.000, y = 211.913, z = 0.000 }, level = 16, drop_tag = "采集动物", area_id = 5 },
	{ config_id = 158011, monster_id = 28010205, pos = { x = 1151.947, y = 205.090, z = 269.583 }, rot = { x = 23.692, y = 200.336, z = 8.146 }, level = 16, drop_tag = "采集动物", area_id = 5 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 158001, 158002, 158003, 158004, 158005, 158006, 158007, 158008, 158009, 158010, 158011 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================