-- 基础信息
local base_info = {
	group_id = 133106062
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 62001, gadget_id = 70310001, pos = { x = -903.962, y = 172.430, z = 1303.777 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 62002, gadget_id = 70310001, pos = { x = -870.125, y = 155.469, z = 1292.050 }, rot = { x = 8.001, y = 0.243, z = 0.920 }, level = 32, state = GadgetState.GearStart, area_id = 8 },
	{ config_id = 62003, gadget_id = 70310001, pos = { x = -865.534, y = 158.784, z = 1297.758 }, rot = { x = 0.000, y = 0.179, z = 0.000 }, level = 32, state = GadgetState.GearStart, area_id = 8 },
	{ config_id = 62004, gadget_id = 70310001, pos = { x = -853.793, y = 160.582, z = 1282.605 }, rot = { x = 0.000, y = 0.179, z = 0.000 }, level = 32, state = GadgetState.GearStart, area_id = 8 },
	{ config_id = 62005, gadget_id = 70310001, pos = { x = -884.664, y = 155.320, z = 1282.660 }, rot = { x = 0.000, y = 0.179, z = 0.000 }, level = 32, state = GadgetState.GearStart, area_id = 8 },
	{ config_id = 62006, gadget_id = 70220014, pos = { x = -887.643, y = 155.320, z = 1282.515 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 62007, gadget_id = 70220014, pos = { x = -886.422, y = 155.320, z = 1282.463 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 62008, gadget_id = 70220014, pos = { x = -881.864, y = 155.442, z = 1292.989 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 62009, gadget_id = 70220014, pos = { x = -881.737, y = 155.266, z = 1295.152 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 62010, gadget_id = 70220013, pos = { x = -883.522, y = 155.436, z = 1294.698 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 62011, gadget_id = 70300085, pos = { x = -862.603, y = 160.402, z = 1283.998 }, rot = { x = 0.000, y = 38.759, z = 0.000 }, level = 32, area_id = 8 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 62001, 62002, 62003, 62004, 62005, 62006, 62007, 62008, 62009, 62010, 62011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================