-- 基础信息
local base_info = {
	group_id = 133304423
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 423001, monster_id = 22010101, pos = { x = -1471.701, y = 236.068, z = 2620.114 }, rot = { x = 0.000, y = 58.300, z = 0.000 }, level = 1, drop_tag = "深渊法师", isElite = true, pose_id = 9013, area_id = 21 },
	{ config_id = 423002, monster_id = 21010601, pos = { x = -1466.269, y = 236.133, z = 2626.133 }, rot = { x = 0.000, y = 229.482, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9012, area_id = 21 },
	{ config_id = 423003, monster_id = 21010201, pos = { x = -1462.966, y = 237.219, z = 2625.376 }, rot = { x = 0.000, y = 235.500, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9012, area_id = 21 },
	{ config_id = 423004, monster_id = 21010201, pos = { x = -1462.842, y = 238.059, z = 2621.323 }, rot = { x = 0.000, y = 303.239, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9012, area_id = 21 },
	{ config_id = 423005, monster_id = 21010601, pos = { x = -1465.406, y = 238.164, z = 2618.804 }, rot = { x = 0.000, y = 255.426, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9012, area_id = 21 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 423006, gadget_id = 70300107, pos = { x = -1467.469, y = 236.666, z = 2621.593 }, rot = { x = 0.000, y = 323.700, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 21 },
	{ config_id = 423007, gadget_id = 70220013, pos = { x = -1472.364, y = 234.867, z = 2625.199 }, rot = { x = 348.590, y = 71.300, z = 5.321 }, level = 1, area_id = 21 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	gadgets = {
		{ config_id = 423008, gadget_id = 70220013, pos = { x = -1466.432, y = 239.880, z = 2613.875 }, rot = { x = 25.675, y = 326.365, z = 15.188 }, level = 1, area_id = 21 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 423001, 423002, 423003, 423004, 423005 },
		gadgets = { 423006, 423007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================