-- 基础信息
local base_info = {
	group_id = 133106560
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	monsters = {
		{ config_id = 560002, monster_id = 25010201, pos = { x = -739.813, y = 130.367, z = 1609.095 }, rot = { x = 0.000, y = 134.189, z = 0.000 }, level = 36, drop_tag = "盗宝团", pose_id = 9003, area_id = 19 }
	},
	gadgets = {
		{ config_id = 560001, gadget_id = 70211001, pos = { x = -739.015, y = 130.355, z = 1608.207 }, rot = { x = 0.000, y = 324.616, z = 0.000 }, level = 26, drop_tag = "战斗低级璃月", isOneoff = true, persistent = true, explore = { name = "chest", exp = 1 }, area_id = 19 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================