-- 基础信息
local base_info = {
	group_id = 133217183
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 183001, gadget_id = 70290001, pos = { x = -4250.153, y = 201.949, z = -3840.139 }, rot = { x = 0.000, y = 64.411, z = 0.000 }, level = 30, area_id = 14 },
	{ config_id = 183002, gadget_id = 70500000, pos = { x = -4249.784, y = 202.518, z = -3839.981 }, rot = { x = 0.000, y = 64.411, z = 0.000 }, level = 30, point_type = 3002, owner = 183001, area_id = 14 },
	{ config_id = 183003, gadget_id = 70500000, pos = { x = -4250.538, y = 202.804, z = -3840.252 }, rot = { x = 0.000, y = 64.411, z = 0.000 }, level = 30, point_type = 3002, owner = 183001, area_id = 14 },
	{ config_id = 183004, gadget_id = 70500000, pos = { x = -4250.130, y = 203.216, z = -3840.426 }, rot = { x = 0.000, y = 64.411, z = 0.000 }, level = 30, point_type = 3002, owner = 183001, area_id = 14 },
	{ config_id = 183005, gadget_id = 70290001, pos = { x = -4299.495, y = 217.301, z = -3849.514 }, rot = { x = 344.930, y = 289.104, z = 344.876 }, level = 30, area_id = 14 },
	{ config_id = 183006, gadget_id = 70500000, pos = { x = -4299.674, y = 217.931, z = -3849.278 }, rot = { x = 344.930, y = 289.104, z = 344.876 }, level = 30, point_type = 3002, owner = 183005, area_id = 14 },
	{ config_id = 183007, gadget_id = 70500000, pos = { x = -4298.875, y = 218.011, z = -3849.559 }, rot = { x = 344.930, y = 289.104, z = 344.876 }, level = 30, point_type = 3002, owner = 183005, area_id = 14 },
	{ config_id = 183008, gadget_id = 70500000, pos = { x = -4298.925, y = 218.387, z = -3849.088 }, rot = { x = 344.930, y = 289.104, z = 344.876 }, level = 30, point_type = 3002, owner = 183005, area_id = 14 },
	{ config_id = 183009, gadget_id = 70500000, pos = { x = -4294.435, y = 216.675, z = -3902.247 }, rot = { x = 0.000, y = 357.448, z = 0.000 }, level = 30, point_type = 2001, area_id = 14 },
	{ config_id = 183010, gadget_id = 70500000, pos = { x = -4331.921, y = 202.047, z = -3905.527 }, rot = { x = 0.000, y = 172.491, z = 0.000 }, level = 30, point_type = 2004, area_id = 14 },
	{ config_id = 183011, gadget_id = 70500000, pos = { x = -4320.922, y = 199.222, z = -4064.249 }, rot = { x = 0.000, y = 31.148, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183012, gadget_id = 70500000, pos = { x = -4319.189, y = 199.285, z = -4057.883 }, rot = { x = 0.000, y = 148.392, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183013, gadget_id = 70500000, pos = { x = -4313.769, y = 199.131, z = -4029.109 }, rot = { x = 0.000, y = 237.995, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183014, gadget_id = 70500000, pos = { x = -4324.058, y = 199.588, z = -4009.484 }, rot = { x = 0.000, y = 230.104, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183015, gadget_id = 70500000, pos = { x = -4306.626, y = 198.858, z = -3991.763 }, rot = { x = 0.000, y = 72.032, z = 0.000 }, level = 30, point_type = 2037, area_id = 14 },
	{ config_id = 183016, gadget_id = 70500000, pos = { x = -4310.218, y = 198.884, z = -3994.830 }, rot = { x = 0.000, y = 284.102, z = 0.000 }, level = 30, point_type = 2037, area_id = 14 },
	{ config_id = 183017, gadget_id = 70500000, pos = { x = -4311.035, y = 198.508, z = -3984.269 }, rot = { x = 0.000, y = 277.538, z = 0.000 }, level = 30, point_type = 2037, area_id = 14 },
	{ config_id = 183018, gadget_id = 70500000, pos = { x = -4327.570, y = 199.080, z = -3987.344 }, rot = { x = 0.000, y = 287.222, z = 0.000 }, level = 30, point_type = 2037, area_id = 14 },
	{ config_id = 183019, gadget_id = 70500000, pos = { x = -4244.597, y = 199.796, z = -3942.295 }, rot = { x = 0.000, y = 124.119, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183020, gadget_id = 70500000, pos = { x = -4238.169, y = 199.695, z = -3917.327 }, rot = { x = 0.000, y = 340.628, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183021, gadget_id = 70500000, pos = { x = -4196.951, y = 198.803, z = -3891.505 }, rot = { x = 0.000, y = 250.244, z = 0.000 }, level = 30, point_type = 2037, area_id = 14 },
	{ config_id = 183022, gadget_id = 70500000, pos = { x = -4194.616, y = 198.563, z = -3891.418 }, rot = { x = 0.000, y = 77.807, z = 0.000 }, level = 30, point_type = 2037, area_id = 14 },
	{ config_id = 183023, gadget_id = 70500000, pos = { x = -4251.999, y = 197.923, z = -3946.948 }, rot = { x = 0.000, y = 124.119, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183024, gadget_id = 70500000, pos = { x = -4289.741, y = 215.629, z = -3894.658 }, rot = { x = 0.000, y = 273.166, z = 0.000 }, level = 30, point_type = 2040, area_id = 14 },
	{ config_id = 183025, gadget_id = 70500000, pos = { x = -4301.993, y = 219.448, z = -3916.862 }, rot = { x = 348.712, y = 226.849, z = 5.160 }, level = 30, point_type = 2040, area_id = 14 },
	{ config_id = 183026, gadget_id = 70520036, pos = { x = -4341.641, y = 202.251, z = -3892.632 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 30, area_id = 14 },
	{ config_id = 183027, gadget_id = 70500000, pos = { x = -4341.563, y = 202.987, z = -3892.632 }, rot = { x = 0.000, y = 0.000, z = 354.199 }, level = 30, point_type = 2042, owner = 183026, area_id = 14 },
	{ config_id = 183028, gadget_id = 70290001, pos = { x = -4239.172, y = 201.446, z = -3905.647 }, rot = { x = 358.493, y = 236.553, z = 4.206 }, level = 30, area_id = 14 },
	{ config_id = 183029, gadget_id = 70500000, pos = { x = -4239.481, y = 202.025, z = -3905.881 }, rot = { x = 358.493, y = 236.553, z = 4.206 }, level = 30, point_type = 3002, owner = 183028, area_id = 14 },
	{ config_id = 183030, gadget_id = 70500000, pos = { x = -4238.754, y = 202.283, z = -3905.523 }, rot = { x = 358.493, y = 236.553, z = 4.206 }, level = 30, point_type = 3002, owner = 183028, area_id = 14 },
	{ config_id = 183031, gadget_id = 70500000, pos = { x = -4239.154, y = 202.726, z = -3905.426 }, rot = { x = 358.493, y = 236.553, z = 4.206 }, level = 30, point_type = 3002, owner = 183028, area_id = 14 },
	{ config_id = 183032, gadget_id = 70290001, pos = { x = -4302.578, y = 201.793, z = -3956.629 }, rot = { x = 0.000, y = 65.975, z = 0.000 }, level = 30, area_id = 14 },
	{ config_id = 183033, gadget_id = 70500000, pos = { x = -4302.205, y = 202.362, z = -3956.481 }, rot = { x = 0.000, y = 65.975, z = 0.000 }, level = 30, point_type = 3002, owner = 183032, area_id = 14 },
	{ config_id = 183034, gadget_id = 70500000, pos = { x = -4302.966, y = 202.648, z = -3956.731 }, rot = { x = 0.000, y = 65.975, z = 0.000 }, level = 30, point_type = 3002, owner = 183032, area_id = 14 },
	{ config_id = 183035, gadget_id = 70500000, pos = { x = -4302.563, y = 203.060, z = -3956.916 }, rot = { x = 0.000, y = 65.975, z = 0.000 }, level = 30, point_type = 3002, owner = 183032, area_id = 14 },
	{ config_id = 183036, gadget_id = 70500000, pos = { x = -4303.002, y = 199.163, z = -4050.511 }, rot = { x = 0.000, y = 148.392, z = 0.000 }, level = 30, point_type = 2033, area_id = 14 },
	{ config_id = 183037, gadget_id = 70500000, pos = { x = -4256.149, y = 210.780, z = -3899.833 }, rot = { x = 358.440, y = 350.728, z = 355.666 }, level = 30, point_type = 2004, area_id = 14 },
	{ config_id = 183038, gadget_id = 70500000, pos = { x = -4341.698, y = 202.786, z = -3892.483 }, rot = { x = 21.666, y = 328.572, z = 5.608 }, level = 30, point_type = 2042, owner = 183026, area_id = 14 },
	{ config_id = 183039, gadget_id = 70500000, pos = { x = -4310.671, y = 203.276, z = -3887.026 }, rot = { x = 4.636, y = 296.548, z = 344.038 }, level = 30, point_type = 1002, area_id = 14 },
	{ config_id = 183041, gadget_id = 70500000, pos = { x = -4350.884, y = 200.954, z = -4007.850 }, rot = { x = 0.000, y = 143.719, z = 0.000 }, level = 30, point_type = 2040, area_id = 14 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	gadgets = {
		{ config_id = 183040, gadget_id = 70500000, pos = { x = -4311.743, y = 202.965, z = -3889.633 }, rot = { x = 13.186, y = 48.987, z = 10.184 }, level = 30, point_type = 1002, area_id = 14 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 183001, 183002, 183003, 183004, 183005, 183006, 183007, 183008, 183009, 183010, 183011, 183012, 183013, 183014, 183015, 183016, 183017, 183018, 183019, 183020, 183021, 183022, 183023, 183024, 183025, 183026, 183027, 183028, 183029, 183030, 183031, 183032, 183033, 183034, 183035, 183036, 183037, 183038, 183039, 183041 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================