-- 基础信息
local base_info = {
	group_id = 133213072
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 72001, monster_id = 25100101, pos = { x = -3967.066, y = 200.563, z = -3232.057 }, rot = { x = 7.419, y = 214.130, z = 358.580 }, level = 25, drop_tag = "高阶武士", disableWander = true, pose_id = 1001, area_id = 12 },
	{ config_id = 72004, monster_id = 25010301, pos = { x = -3970.401, y = 200.174, z = -3233.683 }, rot = { x = 0.689, y = 128.550, z = 354.840 }, level = 27, drop_tag = "盗宝团", disableWander = true, pose_id = 9009, area_id = 12 },
	{ config_id = 72005, monster_id = 25010501, pos = { x = -3968.803, y = 200.134, z = -3235.561 }, rot = { x = 0.041, y = 300.511, z = 5.206 }, level = 27, drop_tag = "盗宝团", disableWander = true, pose_id = 9009, area_id = 12 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 72006, gadget_id = 70310004, pos = { x = -3963.980, y = 200.979, z = -3231.842 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, state = GadgetState.GearStart, area_id = 12 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 72001, 72004, 72005 },
		gadgets = { 72006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================