-- 基础信息
local base_info = {
	group_id = 133310256
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 256001, gadget_id = 70210101, pos = { x = -2306.134, y = 120.267, z = 5061.799 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256002, gadget_id = 70210101, pos = { x = -2299.458, y = 119.781, z = 5060.001 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256003, gadget_id = 70210101, pos = { x = -2295.677, y = 120.098, z = 5062.195 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256004, gadget_id = 70210101, pos = { x = -2296.062, y = 119.303, z = 5037.465 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256005, gadget_id = 70210101, pos = { x = -2305.792, y = 119.987, z = 5036.055 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256006, gadget_id = 70210101, pos = { x = -2400.806, y = 120.111, z = 5041.264 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256007, gadget_id = 70210101, pos = { x = -2410.831, y = 119.706, z = 5041.176 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256008, gadget_id = 70210101, pos = { x = -2414.236, y = 119.682, z = 5056.445 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", area_id = 27 },
	{ config_id = 256009, gadget_id = 70900386, pos = { x = -2398.848, y = 120.091, z = 5056.163 }, rot = { x = 0.198, y = 6.260, z = 0.022 }, level = 26, drop_tag = "书页章节3须弥", isOneoff = true, persistent = true, area_id = 27 },
	{ config_id = 256010, gadget_id = 70210101, pos = { x = -2381.111, y = 95.842, z = 5091.714 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256011, gadget_id = 70210101, pos = { x = -2371.833, y = 96.151, z = 5091.689 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256012, gadget_id = 70210101, pos = { x = -2370.924, y = 95.816, z = 5066.260 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256013, gadget_id = 70210101, pos = { x = -2380.970, y = 95.850, z = 5066.120 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜遗物须弥", area_id = 27 },
	{ config_id = 256014, gadget_id = 70210101, pos = { x = -2324.030, y = 95.928, z = 5092.868 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", area_id = 27 },
	{ config_id = 256015, gadget_id = 70210101, pos = { x = -2316.820, y = 95.103, z = 5067.915 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", area_id = 27 },
	{ config_id = 256016, gadget_id = 70210101, pos = { x = -2328.506, y = 95.817, z = 5065.718 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", area_id = 27 },
	{ config_id = 256017, gadget_id = 70900386, pos = { x = -2318.949, y = 96.001, z = 5091.139 }, rot = { x = 0.186, y = 20.436, z = 0.069 }, level = 26, drop_tag = "书页章节3须弥", isOneoff = true, persistent = true, area_id = 27 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 256001, 256002, 256003, 256004, 256005, 256006, 256007, 256008, 256009, 256010, 256011, 256012, 256013, 256014, 256015, 256016, 256017 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================