-- 基础信息
local base_info = {
	group_id = 133313192
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
	-- 机器人2
	{ config_id = 192001, shape = RegionShape.SPHERE, radius = 60, pos = { x = -129.863, y = 176.500, z = 5371.620 }, area_id = 32, vision_type_list = { 33130003 } },
	-- 机器人3
	{ config_id = 192002, shape = RegionShape.SPHERE, radius = 65, pos = { x = -558.644, y = 128.467, z = 5814.097 }, area_id = 32, vision_type_list = { 33130004 } },
	-- 机器人4
	{ config_id = 192003, shape = RegionShape.SPHERE, radius = 60, pos = { x = -856.013, y = -22.111, z = 5829.187 }, area_id = 32, vision_type_list = { 33130005 } }
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { 192001, 192002, 192003 },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================