-- 基础信息
local base_info = {
	group_id = 133105902
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 902001, monster_id = 21020601, pos = { x = 655.181, y = 203.542, z = -878.174 }, rot = { x = 0.000, y = 3.928, z = 0.000 }, level = 32, drop_tag = "丘丘暴徒", climate_area_id = 1, area_id = 10 },
	{ config_id = 902002, monster_id = 21020601, pos = { x = 658.678, y = 201.147, z = -848.244 }, rot = { x = 0.000, y = 180.000, z = 0.000 }, level = 32, drop_tag = "丘丘暴徒", climate_area_id = 1, area_id = 10 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { 902001, 902002 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================