-- 基础信息
local base_info = {
	group_id = 133213064
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 64001, monster_id = 28030102, pos = { x = -3780.348, y = 200.095, z = -2900.960 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "鸟类", pose_id = 2, area_id = 12 },
	{ config_id = 64002, monster_id = 28030102, pos = { x = -3784.293, y = 200.094, z = -2933.512 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "鸟类", pose_id = 2, area_id = 12 },
	{ config_id = 64003, monster_id = 28030102, pos = { x = -3861.094, y = 200.326, z = -2899.667 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "鸟类", pose_id = 2, area_id = 12 },
	{ config_id = 64004, monster_id = 28030102, pos = { x = -4007.042, y = 200.220, z = -2915.478 }, rot = { x = 0.000, y = 236.834, z = 0.000 }, level = 27, drop_tag = "鸟类", pose_id = 2, area_id = 12 },
	{ config_id = 64005, monster_id = 28030102, pos = { x = -3996.175, y = 200.038, z = -2982.778 }, rot = { x = 0.000, y = 294.834, z = 0.000 }, level = 27, drop_tag = "鸟类", pose_id = 2, area_id = 12 },
	{ config_id = 64006, monster_id = 28040101, pos = { x = -3792.655, y = 200.000, z = -2891.512 }, rot = { x = 0.000, y = 142.977, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 12 },
	{ config_id = 64007, monster_id = 28040101, pos = { x = -3794.533, y = 200.000, z = -2894.929 }, rot = { x = 0.000, y = 345.066, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 12 },
	{ config_id = 64008, monster_id = 28040101, pos = { x = -4019.425, y = 200.000, z = -2920.214 }, rot = { x = 0.000, y = 291.176, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 12 },
	{ config_id = 64009, monster_id = 28040101, pos = { x = -4018.523, y = 200.000, z = -2923.416 }, rot = { x = 0.000, y = 61.762, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 12 },
	{ config_id = 64010, monster_id = 28040101, pos = { x = -3944.287, y = 200.000, z = -2864.093 }, rot = { x = 0.000, y = 342.500, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 12 },
	{ config_id = 64011, monster_id = 28040101, pos = { x = -3946.066, y = 200.000, z = -2865.030 }, rot = { x = 0.000, y = 21.691, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 12 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 64001, 64002, 64003, 64004, 64005, 64006, 64007, 64008, 64009, 64010, 64011 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================