-- 基础信息
local base_info = {
	group_id = 133301008
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 8001, monster_id = 28030101, pos = { x = -291.185, y = 200.256, z = 3577.606 }, rot = { x = 0.000, y = 226.627, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 29 },
	{ config_id = 8002, monster_id = 28030101, pos = { x = -327.933, y = 228.920, z = 3564.073 }, rot = { x = 0.000, y = 248.643, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 29 },
	{ config_id = 8003, monster_id = 28040102, pos = { x = -314.887, y = 200.030, z = 3559.995 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 29 },
	{ config_id = 8004, monster_id = 28030101, pos = { x = -329.276, y = 229.140, z = 3566.994 }, rot = { x = 0.000, y = 242.572, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 29 },
	{ config_id = 8005, monster_id = 28040102, pos = { x = -319.697, y = 200.030, z = 3555.490 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 29 },
	{ config_id = 8006, monster_id = 28030313, pos = { x = -335.662, y = 201.591, z = 3541.921 }, rot = { x = 0.000, y = 359.335, z = 0.000 }, level = 1, drop_tag = "鸟类", pose_id = 3, area_id = 29 },
	{ config_id = 8007, monster_id = 28040103, pos = { x = -317.645, y = 200.030, z = 3557.835 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 29 },
	{ config_id = 8009, monster_id = 28040101, pos = { x = -334.688, y = 200.030, z = 3559.054 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "水族", area_id = 29 },
	{ config_id = 8010, monster_id = 28010304, pos = { x = -339.077, y = 215.041, z = 3612.290 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "采集动物", area_id = 29 },
	{ config_id = 8011, monster_id = 28010304, pos = { x = -328.365, y = 200.231, z = 3571.615 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "采集动物", area_id = 29 },
	{ config_id = 8012, monster_id = 28010304, pos = { x = -361.701, y = 201.611, z = 3538.358 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, drop_tag = "采集动物", area_id = 29 },
	{ config_id = 8013, monster_id = 28010304, pos = { x = -383.563, y = 210.655, z = 3601.595 }, rot = { x = 0.000, y = 329.889, z = 0.000 }, level = 27, drop_tag = "采集动物", area_id = 22 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 8001, 8002, 8003, 8004, 8005, 8006, 8007, 8009, 8010, 8011, 8012, 8013 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================