-- 任务配置数据开始-----------------------------

main_id = 19090

sub_ids = 
{
	1909002,
	1909003,
	1909006,
	1909001,
	1909007,
	1909008,
	1909004,
	1909005,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = 
	{
		QUEST_EXEC_DEL_ALL_SPECIFIC_PACK_ITEM = 
		{
			{ "100764", },
			{ "100765", },
		},
	},
}

cancel_action = 
{
	CLIENT = { },
	SERVER = 
	{
		QUEST_EXEC_DEL_ALL_SPECIFIC_PACK_ITEM = 
		{
			{ "100764", },
			{ "100765", },
		},
		QUEST_EXEC_UNREGISTER_DYNAMIC_GROUP = 
		{
			{ "133003925", "", },
			{ "133003927", "", },
			{ "133003007", "", },
		},
		QUEST_EXEC_REMOVE_TRIAL_AVATAR = 
		{
			{ "500", },
		},
	},
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["1909002"] = { },
	["1909003"] =
	{ 
		gadgets = 
		{
			{
				id = 70540011,
				alias = "Gadget70540011",
				pos = "Q1909002tree",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1909006"] = { },
	["1909007"] = {
		gadgets = 
		{
			{
				id = 70710344,
				alias = "Gadget70710344",
				pos = "Q1909001rabbit",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	 },
	["1909008"] = 
	{
		gadgets = 
		{
			{
				id = 70710344,
				alias = "Gadget70710344",
				pos = "Q1909001rabbit",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["1909001"] = 
	{
		gadgets = 
		{
			{
				id = 70710338,
				alias = "Gadget70710338",
				pos = "Q1909001point",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 70710344,
				alias = "Gadget70710344",
				pos = "Q1909001rabbit",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["1909002"] = 
	{
		gadgets = 
		{
		   {
			id = 70710356,
			alias = "Gadget70710356data1",
			pos = "Q1909002berry1",
			scene_id = 3,
			room_id = 0,
			data_index = 1,
		  },
		  {
			id = 70710356,
			alias = "Gadget70710356data2",
			pos = "Q1909002berry2",
			scene_id = 3,
			room_id = 0,
			data_index = 2,
		  },
		  {
			id = 70710356,
			alias = "Gadget70710356data3",
			pos = "Q1909002berry3",
			scene_id = 3,
			room_id = 0,
			data_index = 3,
		  },
		  {
			id = 70710327,
			alias = "Gadget70710327",
			pos = "Q1909003target",
			scene_id = 3,
			room_id = 0,
			data_index = 4,
		  },
		  {
			id = 70540011,
			alias = "Gadget70540011",
			pos = "Q1909002tree",
			scene_id = 3,
			room_id = 0,
			data_index = 5,
		  },
		},  
	},
	["1909003"] = { },
	["1909004"] = { },
	["1909005"] = { },
	["1909006"] = 
	{
		npcs = 
		{
			{
				id = 1027,
				alias = "Npc1027",
				script = "Actor/Npc/TempNPC",
				pos = "Q1909008Noel",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1909007"] = {},
	["1909008"] = 
	{
		npcs = 
		{
			{
				id = 1027,
				alias = "Npc1027",
				script = "Actor/Npc/TempNPC",
				pos = "Q1909006Noel",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
