-- 任务配置数据开始-----------------------------

main_id = 19032

sub_ids = 
{
	1903201,
	1903202,
	1903203,
	1903204,
	1903205,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { 
		QUEST_EXEC_REFRESH_GROUP_SUITE = 
		{
			{ "3", "133102924,1", },
			{ "3", "133102926,1", },
		},
	},
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = { 
		QUEST_EXEC_REFRESH_GROUP_SUITE = 
		{
			{ "3", "133102924,1", },
			{ "3", "133102926,1", },
		},
	},
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["1903201"] = { },
	["1903202"] = 
	{
		npcs = 
		{
			{
				id = 10918,
				alias = "Npc10918",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903201male",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1903203"] = { },
	["1903204"] = { },
	["1903205"] = { },
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["1903201"] = 
	{
		npcs = 
		{
			{
				id = 10918,
				alias = "Npc10918",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903201male",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1903202"] = 
	{
		npcs = 
		{
			{
				id = 1023,
				alias = "Npc1023",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903202cy",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1903203"] = 
	{
		npcs = 
		{
			{
				id = 10907,
				alias = "Npc10907",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903203jiujiu",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1903204"] = 
	{
		npcs = 
		{
			{
				id = 10918,
				alias = "Npc10918",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903204male",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 1023,
				alias = "Npc1023",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903204Cy",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
			{
				id = 10905,
				alias = "Npc10905",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903204male2",
				scene_id = 3,
				room_id = 0,
				data_index = 3,
			},
			{
				id = 10917,
				alias = "Npc10917",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903204male3",
				scene_id = 3,
				room_id = 0,
				data_index = 4,
			},
		},
	},
	["1903205"] = {
		npcs = 
		{
			{
				id = 10907,
				alias = "Npc10907",
				script = "Actor/Npc/TempNPC",
				pos = "Q1903203jiujiu",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	 },
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

