-- 任务配置数据开始-----------------------------

main_id = 19083

sub_ids = 
{
	1908301,
	1908302,
	1908303,
	1908312,
	1908304,
	1908305,
	1908306,
	1908307,
	1908308,
	1908310,
	1908311,
	1908313,
	1908309,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = 
	{
		QUEST_EXEC_UNREGISTER_DYNAMIC_GROUP = 
		{
			{ "133102928", "", },
		},
		QUEST_EXEC_REMOVE_TRIAL_AVATAR = 
		{
			{ "500", },
		},
	},
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["1908301"] = { },
	["1908303"] = { },
	["1908304"] = { },
	["1908306"] = { },
	["1908307"] = { },
	["1908308"] = { },
	["1908312"] = { 
		npcs = 
		{
			{
				id = 11006,
				alias = "Npc11006",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908303shayin",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["1908301"] = { },
	["1908302"] = 
	{
		npcs = 
		{
			{
				id = 1027,
				alias = "Npc1027",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908301Noel",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 11006,
				alias = "Npc11006",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908301shayin",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["1908303"] = 
	{
		npcs = 
		{
			{
				id = 11006,
				alias = "Npc11006",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908303shayin",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1908304"] = { },
	["1908305"] = 
	{
		npcs = 
		{
			{
				id = 1027,
				alias = "Npc1027",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908304Noel",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1908306"] = { },
	["1908307"] = 
	{
		npcs = 
		{
			{
				id = 1027,
				alias = "Npc1027",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908304Noel",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 11006,
				alias = "Npc11006",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908307shayin",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["1908308"] = { },
	["1908309"] = { },
	["1908310"] = 
	{
		npcs = 
		{
			{
				id = 1027,
				alias = "Npc1027",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908308Noel",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1908311"] = { },
	["1908312"] = 
	{
		npcs = 
		{
			{
				id = 1027,
				alias = "Npc1027",
				script = "Actor/Npc/TempNPC",
				pos = "Q1908303Noel",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1908313"] = { },
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
