-- 任务配置数据开始-----------------------------

main_id = 19023

sub_ids = 
{
	1902301,
	1902302,
	1902303,
	1902304,
	1902305,
	1902306,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = { 
		QUEST_EXEC_REFRESH_GROUP_SUITE = 
		{
			{ "3", "133102923,1", },
			{ "3", "133102925,1", },
			{ "3", "133102913,1", },

		},
	},
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["1902301"] = { },
	["1902302"] = { },
	["1902303"] = { },
	["1902304"] = { },
	["1902305"] = { },
	["1902306"] = { },
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["1902301"] = 
	{
		npcs = 
		{
			{
				id = 1023,
				alias = "Npc1023",
				script = "Actor/Npc/TempNPC",
				pos = "Q1902301CY",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1902302"] = 
	{
		npcs = 
		{
			{
				id = 1023,
				alias = "Npc1023",
				script = "Actor/Npc/TempNPC",
				pos = "Q1902302Cy",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["1902303"] = 
	{
		npcs = 
		{
			{
				id = 1023,
				alias = "Npc1023",
				script = "Actor/Npc/TempNPC",
				pos = "Q1902303Cy",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 10913,
				alias = "Npc10913",
				script = "Actor/Npc/TempNPC",
				pos = "Q1902303Cy",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["1902304"] = 
	{
		npcs = 
		{
			{
				id = 1023,
				alias = "Npc1023",
				script = "Actor/Npc/TempNPC",
				pos = "Q1902304Cy",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 10914,
				alias = "Npc10914",
				script = "Actor/Npc/TempNPC",
				pos = "Q1902304Cy",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["1902305"] = { },
	["1902306"] = 
	{
		npcs = 
		{
			{
				id = 1023,
				alias = "Npc1023",
				script = "Actor/Npc/TempNPC",
				pos = "Q1902305Cy",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
		transmit_points = {
			{
				point_id = 1,
				scene_id = 3,
				pos = "Q1902305Born"
			},
		}
	},
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

