-- 父任务id
main_id = 20061

-- 子任务id
sub_ids = {
	2006101,
	2006102,
	2006103,
	2006104,
	2006105,
	2006106,
	2006107,
	2006108,
	2006109,
	2006110,
	2006111,
	2006112,
	2006113,
	2006114,
	2006115,
	2006116,
	2006117,
	2006118,
	2006119,
	2006120,

}

-- 存放断线重连生成内容，和questdata配的存档点对应
rewind_data = {
	["2006101"] = {
	},
	["2006102"] = {
	},
	["2006106"] = {
	},
	["2006107"] = {
	},
	["2006108"] = {
	},
	["2006109"] = {
	},
	["2006110"] = {
	},
	["2006111"] = {
	},
	["2006114"] = {
	},
	["2006115"] = {

	}

}

-- 校验用，和任务lua中生成NPC/monster/gadget/item等对应
quest_data = {
	["2006101"] = {
	},
	["2006102"] = {
	},
	["2006106"] = {
	},
	["2006107"] = {
	},
	["2006108"] = {
	},
	["2006109"] = {
	},
	["2006110"] = {
	},
	["2006111"] = {
	},
	["2006114"] = {
	},
	["2006115"] = {
		npcs  = {
			{
				id = 1005,
				alias = "Paimon",
				script = "Actor/Quest/Q352/Paimon",
				pos = "Q20061Des05",
				scene_id = 3,
				data_index = 1,
			},
		}
	}

}

finish_action = {}
fail_action = {}
cancel_action = {}

finish_action =
{
	CLIENT = {},
	SERVER = {
		QUEST_EXEC_REFRESH_GROUP_SUITE =
		{
			{"3","133002310,1"},
			{"3","133002313,1"},
			{"3","133002311,1"},
		},
		QUEST_EXEC_DEL_ALL_SPECIFIC_PACK_ITEM =
		{
			{"100354,100352"},
		}
	},
}


cancel_action =
{
	CLIENT = {},
	SERVER = {
		QUEST_EXEC_REFRESH_GROUP_SUITE =
		{
			{"3","133002310,1"},
			{"3","133002313,1"},
			{"3","133002311,1"},
		},
		QUEST_EXEC_DEL_ALL_SPECIFIC_PACK_ITEM =
		{
			{"100354,100352"},
		}
	},
}
