-- 任务配置数据开始-----------------------------

main_id = 2011

sub_ids = 
{
	201101,
	201102,
	201103,
	201104,
	201105,
	201106,
	201107,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = { },
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["201101"] = { },
	["201102"] = { },
	["201103"] = 
	{
		npcs = 
		{
			{
				id = 1031,
				alias = "Npc1031",
				script = "Actor/Npc/TempNPC",
				pos = "Q2011Beidou01",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["201104"] = { 
		avatar = {
			scene_id = 3,
			pos = "Q2011Player"
		},
	},
	["201105"] = { },
	["201106"] = { },
	["201107"] = { },
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["201101"] = 
	{
		npcs = 
		{
			{
				id = 2078,
				alias = "Npc2078",
				script = "Actor/Npc/NpcFSMBehaviour",
				pos = "Q11120_Katherine_Pos",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["201102"] = 
	{
		npcs = 
		{
			{
				id = 1031,
				alias = "Npc1031",
				script = "Actor/Npc/TempNPC",
				pos = "Q2011Beidou01",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["201103"] = { },
	["201104"] = { 
		transmit_points = {
			{
				point_id = 1,
				scene_id = 3,
				pos = "Q2011Tuoma01"
			},
		}
	},
	["201105"] = {
		transmit_points = {
			{
				point_id = 1,
				scene_id = 3,
				pos = "Q2011Tuoma01"
			},
		}
	},
	["201106"] = { },
	["201107"] = 
	{
		npcs = 
		{
			{
				id = 1031,
				alias = "Npc1031",
				script = "Actor/Npc/TempNPC",
				pos = "Q2011Beidou02",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 1033,
				alias = "Npc1033",
				script = "Actor/Npc/TempNPC",
				pos = "Q2011Tuoma01",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
