-- 任务配置数据开始-----------------------------

main_id = 41336

sub_ids = 
{
	4133610,
	4133601,
	4133602,
	4133603,
	4133604,
	4133605,
	4133606,
	4133607,
	4133608,
	4133609,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = { },
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["4133601"] = { },
	["4133602"] = { },
	["4133603"] = { },
	["4133604"] = { },
	["4133606"] = { },
	["4133608"] = { },
	["4133609"] = 
	{
		npcs = 
		{
			{
				id = 203201,
				alias = "Npc203201",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_BiBo",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["4133601"] = { },
	["4133602"] = { },
	["4133603"] = { },
	["4133604"] = 
	{
		npcs = 
		{
			{
				id = 201701,
				alias = "Npc201701",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_LinLin01",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 200401,
				alias = "Npc200401",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_XiaoZongGuan",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["4133605"] = { },
	["4133606"] = 
	{
		npcs = 
		{
			{
				id = 201701,
				alias = "Npc201701",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_LinLin03",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 204001,
				alias = "Npc204001",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_DeGui",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["4133607"] = { },
	["4133608"] = 
	{
		npcs = 
		{
			{
				id = 201701,
				alias = "Npc201701",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_LinLin05",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 203201,
				alias = "Npc203201",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_BiBo",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["4133609"] = 
	{
		npcs = 
		{
			{
				id = 203201,
				alias = "Npc203201",
				script = "Actor/Npc/TempNPC",
				pos = "Q41336_BiBo",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["4133610"] = { },
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

