-- 任务配置数据开始-----------------------------

main_id = 41335

sub_ids = 
{
	4133509,
	4133501,
	4133502,
	4133503,
	4133506,
	4133507,
	4133508,
	4133504,
	4133505,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = 
	{
		QUEST_EXEC_DEL_ALL_SPECIFIC_PACK_ITEM = 
		{
			{ "100748", },
		},
		QUEST_EXEC_UNREGISTER_DYNAMIC_GROUP = 
		{
			{ "133104921", "1", },
		},
	},
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["4133501"] = { },
	["4133502"] = { },
	["4133503"] = 
	{
		npcs = 
		{
			{
				id = 220501,
				alias = "Npc220501",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133503QingZhou",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["4133504"] = { },
	["4133505"] = { },
	["4133506"] = 
	{
		npcs = 
		{
			{
				id = 240901,
				alias = "Npc240901",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133503Fanmier",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["4133507"] = 
	{
		npcs = 
		{
			{
				id = 240901,
				alias = "Npc240901",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133503Fanmier",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["4133508"] = 
	{
		npcs = 
		{
			{
				id = 240901,
				alias = "Npc240901",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133503Fanmier",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["4133509"] = { },
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["4133501"] = 
	{
		npcs = 
		{
			{
				id = 240901,
				alias = "Npc240901",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133501Fanmier",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["4133502"] = 
	{
		npcs = 
		{
			{
				id = 240901,
				alias = "Npc240901",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133503Fanmier",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 220501,
				alias = "Npc220501",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133503QingZhou",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["4133503"] = 
	{
		npcs = 
		{
			{
				id = 240901,
				alias = "Npc240901",
				script = "Actor/Npc/TempNPC",
				pos = "Q4133503Fanmier",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["4133504"] = { },
	["4133505"] = { },
	["4133506"] = { },
	["4133507"] = { },
	["4133508"] = { },
	["4133509"] = { },
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

