-- 任务配置数据开始-----------------------------

main_id = 70000

sub_ids = 
{
	7000010,
	7000001,
	7000002,
	7000004,
	7000005,
	7000003,
	7000006,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = { 
		QUEST_EXEC_DEL_ALL_SPECIFIC_PACK_ITEM = 
		{
			{ "100759", },
			{ "100760", },
			{ "100761", },
		},
	},
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["7000001"] = { },
	["7000002"] = {
		npcs = 
		{
			{
				id = 164201,
				alias = "Npc164201",
				script = "Actor/Npc/NpcFSMBehaviour",
				pos = "Q7000001sayi",
				scene_id = 1004,
				room_id = 100401,
				data_index = 1,
			},
		},
	 },
	["7000003"] = {
		npcs = 
		{
			{
				id = 142501,
				alias = "Npc142501",
				script = "Actor/Npc/TempNPC",
				pos = "Q1011002Flora",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	 },
	["7000004"] = { },
	["7000005"] = {
		npcs = 
		{
			{
				id = 142501,
				alias = "Npc142501",
				script = "Actor/Npc/TempNPC",
				pos = "Q1011002Flora",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	 },
	["7000006"] = { 
		npcs = 
		{
			{
				id = 142501,
				alias = "Npc142501",
				script = "Actor/Npc/TempNPC",
				pos = "Q1011002Flora",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7000010"] = { },
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["7000001"] = 
	{
		npcs = 
		{
			{
				id = 164201,
				alias = "Npc164201",
				script = "Actor/Npc/NpcFSMBehaviour",
				pos = "Q7000001sayi",
				scene_id = 1004,
				room_id = 100401,
				data_index = 1,
			},
		},
	},
	["7000002"] = { },
	["7000003"] = { },
	["7000004"] = 
	{
		npcs = 
		{
			{
				id = 142501,
				alias = "Npc142501",
				script = "Actor/Npc/TempNPC",
				pos = "Q1011002Flora",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7000005"] = { },
	["7000006"] = 
	{
		npcs = 
		{
			{
				id = 164201,
				alias = "Npc164201",
				script = "Actor/Npc/NpcFSMBehaviour",
				pos = "Q7000001sayi",
				scene_id = 1004,
				room_id = 100401,
				data_index = 1,
			},
		},
	},
	["7000010"] = { },
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
