-- 任务配置数据开始-----------------------------

main_id = 70001

sub_ids = 
{
	7000110,
	7000101,
	7000102,
	7000103,
	7000106,
	7000107,
	7000104,
	7000105,
	7000111,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = { 
		QUEST_EXEC_REFRESH_GROUP_SUITE = 
		{
			{ "3", "133003924,1", },
		},
	},
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["7000101"] = { },
	["7000102"] = { },
	["7000103"] = { 
		npcs = 
		{
			{
				id = 152501,
				alias = "Npc152501",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000101wei",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7000104"] = { },
	["7000105"] = { },
	["7000106"] = { 
		npcs = 
		{
			{
				id = 10397,
				alias = "Npc10397",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000103fasle1",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["7000107"] = {
		npcs = 
		{
			{
				id = 10398,
				alias = "Npc10398",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000103fasle2",
				scene_id = 3,
				room_id = 0,
				data_index = 3,
			},
		},
	 },
	["7000110"] = { },
	["7000111"] = { },
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["7000101"] = 
	{
		npcs = 
		{
			{
				id = 152501,
				alias = "Npc152501",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000101wei",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7000102"] = 
	{
		npcs = 
		{
			{
				id = 152501,
				alias = "Npc152501",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000101wei",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7000103"] = 
	{
		npcs = 
		{
			{
				id = 10396,
				alias = "Npc10396",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000103true1",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 10397,
				alias = "Npc10397",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000103fasle1",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
			{
				id = 10398,
				alias = "Npc10398",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000103fasle2",
				scene_id = 3,
				room_id = 0,
				data_index = 3,
			},
			{
				id = 1005,
				alias = "Paimon",
				script = "Actor/Quest/Q352/Paimon",
				pos = "Q7000103paimon",
				scene_id = 3,
				room_id = 0,
				data_index = 4,
			},
		},
	},
	["7000104"] = { },
	["7000105"] = { },
	["7000106"] = { },
	["7000107"] = { },
	["7000110"] = { },
	["7000111"] = 
	{
		npcs = 
		{
			{
				id = 152501,
				alias = "Npc152501",
				script = "Actor/Npc/TempNPC",
				pos = "Q7000101wei",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
