-- 任务配置数据开始-----------------------------

main_id = 71822

sub_ids = 
{
	7182201,
	7182202,
	7182203,
	7182204,
	7182207,
	7182205,
	7182206,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = {
		QUEST_EXEC_DEL_ALL_SPECIFIC_PACK_ITEM = 
		{
			{ "100752", },
		},
		QUEST_EXEC_UNREGISTER_DYNAMIC_GROUP = 
		{
			{ "133107950", },
			{ "133107952", },
		},
	 },
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["7182201"] = { },
	["7182202"] = 
	{
		npcs = 
		{
			{
				id = 221101,
				alias = "Npc221101",
				script = "Actor/Npc/TempNPC",
				pos = "Q7182201Soraya",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7182203"] = 
	{
		npcs = 
		{
			{
				id = 221101,
				alias = "Npc221101",
				script = "Actor/Npc/TempNPC",
				pos = "Q7182201Soraya",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7182204"] = { },
	["7182205"] = { },
	["7182206"] = {
		npcs = 
		{
			{
				id = 221101,
				alias = "Npc221101",
				script = "Actor/Npc/TempNPC",
				pos = "Q7182206Soraya",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["7182201"] = 
	{
		npcs = 
		{
			{
				id = 221101,
				alias = "Npc221101",
				script = "Actor/Npc/TempNPC",
				pos = "Q7182201Soraya",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7182202"] = 
	{
		gadgets = 
		{
			{
				id = 71700195,
				alias = "Gadget71700195",
				pos = "Q7182202Gadget",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7182203"] = { },
	["7182204"] = { },
	["7182207"] = {
		npcs = 
		{
			{
				id = 221101,
				alias = "Npc221101",
				script = "Actor/Npc/TempNPC",
				pos = "Q7182206Soraya",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7182205"] = {
		npcs = 
		{
			{
				id = 221101,
				alias = "Npc221101",
				script = "Actor/Npc/TempNPC",
				pos = "Q7182206Soraya",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7182206"] = { },
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

