-- 任务配置数据开始-----------------------------

main_id = 73185

sub_ids = 
{
	7318501,
	7318502,
	7318503,
	7318504,
	7318505,
	7318506,
	7318507,
	7318508,
	7318509,
	7318510,
}
-- 任务配置数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 父任务执行项数据开始-----------------------------
finish_action = 
{
	CLIENT = { },
	SERVER = { },
}

fail_action = 
{
	CLIENT = { },
	SERVER = { },
}

cancel_action = 
{
	CLIENT = { },
	SERVER = { },
}
-- 父任务执行项数据结束-----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- Actor模块数据开始--------------------------------
-- 空
-- Actor模块数据结束--------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 文本模块数据开始---------------------------------
-- 空
-- 文本模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
-- 路点模块数据开始---------------------------------
-- 空
-- 路点模块数据结束---------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


-- 断线重连生成内容 开始----------------------------
-- 和questdata配的存档点对应
rewind_data = 
{
	["7318501"] = { },
	["7318502"] = 
	{
		npcs = 
		{
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7318503"] = 
	{
		npcs = 
		{
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7318504"] = 
	{
		npcs = 
		{
			{
				id = 20838,
				alias = "Npc20838",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300145:-984.520,174.477,3654.360,0.000,279.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["7318505"] = 
	{
		npcs = 
		{
			{
				id = 20838,
				alias = "Npc20838",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300145:-984.520,174.477,3654.360,0.000,279.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["7318506"] = 
	{
		npcs = 
		{
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7318507"] = 
	{
		npcs = 
		{
			{
				id = 20839,
				alias = "Npc20839",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300144:-1177.790,189.365,3666.312,9.730,144.760,12.470]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
		},
	},
	["7318508"] = 
	{
		npcs = 
		{
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7318509"] = 
	{
		npcs = 
		{
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 20838,
				alias = "Npc20838",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300302:-1117.669,180.238,3578.531,0.000,129.320,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
			{
				id = 20839,
				alias = "Npc20839",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300301:-1116.823,180.657,3573.314,0.000,28.530,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 3,
			},
		},
	},
	["7318510"] = 
	{
		npcs = 
		{
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 20838,
				alias = "Npc20838",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300302:-1117.669,180.238,3578.531,0.000,129.320,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
			{
				id = 20839,
				alias = "Npc20839",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300301:-1116.823,180.657,3573.314,0.000,28.530,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 3,
			},
		},
	},
}
-- 断线重连生成内容 结束----------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

-- 校验数据 开始----------------------------------
-- 和任务lua中生成NPC/Monster/Gadget/Item等对应
quest_data = 
{
	["7318501"] = 
	{
		npcs = 
		{
			{
				id = 20884,
				alias = "Npc20884",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300143:-1115.350,179.749,3576.298,0.000,85.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7318502"] = { },
	["7318503"] = 
	{
		npcs = 
		{
			{
				id = 20838,
				alias = "Npc20838",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300145:-984.520,174.477,3654.360,0.000,279.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7318504"] = { },
	["7318505"] = { },
	["7318506"] = 
	{
		npcs = 
		{
			{
				id = 20839,
				alias = "Npc20839",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300144:-1177.790,189.365,3666.312,9.730,144.760,12.470]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
		},
	},
	["7318507"] = { },
	["7318508"] = 
	{
		npcs = 
		{
			{
				id = 20838,
				alias = "Npc20838",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300145:-984.520,174.477,3654.360,0.000,279.800,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 1,
			},
			{
				id = 20839,
				alias = "Npc20839",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300144:-1177.790,189.365,3666.312,9.730,144.760,12.470]",
				scene_id = 3,
				room_id = 0,
				data_index = 2,
			},
			{
				id = 20838,
				alias = "Npc20838",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300302:-1117.669,180.238,3578.531,0.000,129.320,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 3,
			},
			{
				id = 20839,
				alias = "Npc20839",
				script = "Actor/Npc/TempNPC",
				pos = "[3_330300301:-1116.823,180.657,3573.314,0.000,28.530,0.000]",
				scene_id = 3,
				room_id = 0,
				data_index = 4,
			},
		},
	},
	["7318509"] = { },
	["7318510"] = { },
}
-- 校验数据 结束----------------------------------
-- >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>