-- 地图配置
scene_config = {
	begin_pos = { x = -499.0, z = -3678.0 },
	size = { x = 6661.0, z = 6585.0 },
	born_pos = { x = 2603.529, y = 581.103, z = -1770.417 },
	born_rot = { x = 0.000, y = 0.000, z = 0.000 },
	born_point_list = {
		{ pos = { x = 2602.278, y = 581.100, z = -1772.213 }, rot = { x = 0.000, y = 90.580, z = 0.000 } },
		{ pos = { x = 2604.139, y = 581.102, z = -1768.494 }, rot = { x = 0.000, y = 90.580, z = 0.000 } },
		{ pos = { x = 2600.219, y = 581.114, z = -1773.887 }, rot = { x = 0.000, y = 90.580, z = 0.000 } },
		{ pos = { x = 2603.635, y = 581.216, z = -1776.125 }, rot = { x = 0.000, y = 90.580, z = 0.000 } }
	},
	die_y = 511.43,
	city_id = 1,
	vision_anchor = { x = -1000.0, z = -4000.0 }
}

-- 所有的区块
blocks = { 35847 }

-- 所有的区块范围坐标
block_rects = {
	{ min = { x = -499.0, z = -3678.0 }, max = { x = 6162.0, z = 2907.0 } }
}

-- Dummy Points
dummy_points = { }

-- Routes
routes_config = { }