-- 所有的group
groups = {
	{ id = 240101001, refresh_id = 1, pos = { x = -7.060, y = -0.175, z = 0.194 } },
	{ id = 240101002, refresh_id = 1, pos = { x = 1.240, y = -0.127, z = 0.564 } },
	{ id = 240101003, refresh_id = 1002, pos = { x = 1.693, y = -0.076, z = 8.816 } },
	{ id = 240101009, refresh_id = 1, pos = { x = 4.774, y = -0.943, z = 2.905 } },
	{ id = 240101010, refresh_id = 1, pos = { x = 3.975, y = 2.396, z = 9.431 } },
	{ id = 240101011, refresh_id = 1, pos = { x = 1.511, y = 2.655, z = -39.291 } }
}