-- 基础信息
local base_info = {
	group_id = 246101003
}

-- DEFS_MISCS
local defs = {
        group_id = 246101003,
        --Boss目标点
        target_points = {3002,3003,3004,3005,3006,3007,3008,3009,3010}
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 3001, monster_id = 28020902, pos = { x = 21.118, y = 1.875, z = 52.387 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, title_id = 10054, special_name_id = 10079 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3002, gadget_id = 70350356, pos = { x = 27.360, y = 1.863, z = 50.947 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 1 },
	{ config_id = 3003, gadget_id = 70350356, pos = { x = 21.042, y = 1.861, z = 50.775 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 2 },
	{ config_id = 3004, gadget_id = 70350356, pos = { x = 12.792, y = 1.860, z = 50.778 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 3 },
	{ config_id = 3005, gadget_id = 70350356, pos = { x = 27.508, y = 1.883, z = 57.815 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 4 },
	{ config_id = 3006, gadget_id = 70350356, pos = { x = 20.594, y = 1.860, z = 57.964 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 5 },
	{ config_id = 3007, gadget_id = 70350356, pos = { x = 12.881, y = 1.869, z = 57.767 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 6 },
	{ config_id = 3008, gadget_id = 70350356, pos = { x = 27.586, y = 1.860, z = 65.762 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 7 },
	{ config_id = 3009, gadget_id = 70350356, pos = { x = 19.940, y = 1.866, z = 66.591 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 8 },
	{ config_id = 3010, gadget_id = 70350356, pos = { x = 12.999, y = 1.874, z = 66.945 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, mark_flag = 9 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 3001 },
		gadgets = { 3002, 3003, 3004, 3005, 3006, 3007, 3008, 3009, 3010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V2_3/HachiDungeon"