-- 基础信息
local base_info = {
	group_id = 111102046
}

-- Trigger变量
local defs = {
	target_region_config_id = 46018,
	related_big_region_config_id = 46027
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	[46002] = { config_id = 46002, gadget_id = 70220006, pos = { x = 1428.115, y = 269.589, z = -1768.745 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1 }
}

-- 区域
regions = {
	-- 小区域
	[46018] = { config_id = 46018, shape = RegionShape.SPHERE, radius = 30, pos = { x = 1428.115, y = 269.589, z = -1768.745 } },
	-- 大区域
	[46027] = { config_id = 46027, shape = RegionShape.SPHERE, radius = 40, pos = { x = 1428.115, y = 269.589, z = -1768.745 } }
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 46002 },
		regions = { 46018, 46027 },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V3_3/TestEyepointLod"