-- 基础信息
local base_info = {
	group_id = 111101232
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 232003, monster_id = 25020101, pos = { x = 2416.401, y = 257.114, z = -1341.009 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "盗宝团" },
	{ config_id = 232004, monster_id = 25030102, pos = { x = 2412.418, y = 256.831, z = -1343.020 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "盗宝团" },
	{ config_id = 232005, monster_id = 25040102, pos = { x = 2412.016, y = 256.275, z = -1347.016 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "盗宝团" },
	{ config_id = 232006, monster_id = 25010105, pos = { x = 2408.619, y = 256.773, z = -1343.598 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "盗宝团" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 232001, gadget_id = 70800056, pos = { x = 2417.831, y = 258.077, z = -1329.870 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1 },
	{ config_id = 232002, gadget_id = 70800056, pos = { x = 2410.295, y = 257.618, z = -1333.765 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1 }
}

-- 区域
regions = {
	{ config_id = 232007, shape = RegionShape.SPHERE, radius = 15, pos = { x = 2414.037, y = 257.603, z = -1336.691 }, team_ability_group_list = { "Firecracker_Play" } },
	{ config_id = 232008, shape = RegionShape.SPHERE, radius = 15, pos = { x = 2414.037, y = 257.603, z = -1336.691 }, team_ability_group_list = { "Firecracker_Play" } }
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 232003, 232004, 232005, 232006 },
		gadgets = { 232001, 232002 },
		regions = { 232007, 232008 },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V2_4/Firecracker"