-- 基础信息
local base_info = {
	group_id = 111101070
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 70001, monster_id = 25010301, pos = { x = 2452.425, y = 209.752, z = -1116.343 }, rot = { x = 0.000, y = 185.343, z = 0.000 }, level = 40, drop_tag = "盗宝团", disableWander = true },
	{ config_id = 70002, monster_id = 25010301, pos = { x = 2459.213, y = 209.345, z = -1119.002 }, rot = { x = 0.000, y = 224.791, z = 0.000 }, level = 40, drop_tag = "盗宝团", disableWander = true },
	{ config_id = 70003, monster_id = 25070101, pos = { x = 2452.561, y = 209.377, z = -1124.628 }, rot = { x = 0.000, y = 207.921, z = 0.000 }, level = 40, drop_tag = "盗宝团", disableWander = true },
	{ config_id = 70004, monster_id = 25010501, pos = { x = 2445.294, y = 209.744, z = -1121.447 }, rot = { x = 0.000, y = 120.376, z = 0.000 }, level = 40, drop_tag = "盗宝团", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 70001, 70002, 70003, 70004 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================