-- 所有的group
groups = {
	{ id = 231604005, refresh_id = 1, pos = { x = 0.891, y = 0.012, z = 8.232 } },
	{ id = 231604006, refresh_id = 1, pos = { x = -0.386, y = 0.012, z = -9.719 } },
	{ id = 231604007, refresh_id = 1002, pos = { x = 5.145, y = 0.012, z = 1.036 } },
	{ id = 231604008, refresh_id = 1002, pos = { x = 5.145, y = 0.012, z = 1.036 } },
	{ id = 231604009, refresh_id = 1, pos = { x = -1.988, y = 0.083, z = -1.417 } },
	{ id = 231604010, refresh_id = 1, pos = { x = 0.000, y = 0.000, z = 0.000 } }
}