-- 基础信息
local base_info = {
	group_id = 250056024
}

-- DEFS_MISCS
local RoomSwitchGadget = 24001
local GroupId = 250056024
local point_id_list = {}
local MainGroupID = 250056020
local RegionID = 24012

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 24001, gadget_id = 70360002, pos = { x = -140.083, y = -0.160, z = -0.315 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1 }
}

-- 区域
regions = {
	{ config_id = 24012, shape = RegionShape.CUBIC, size = { x = 20.000, y = 10.000, z = 20.000 }, pos = { x = -139.864, y = -0.160, z = -0.289 } }
}

-- 触发器
triggers = {
	{ config_id = 1024012, name = "ENTER_REGION_24012", event = EventType.EVENT_ENTER_REGION, source = "", condition = "", action = "" }
}

-- 点位
points = {
	{ config_id = 24002, pos = { x = -139.296, y = -0.157, z = 7.486 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24003, pos = { x = -142.880, y = -0.151, z = 6.772 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24004, pos = { x = -145.730, y = -0.156, z = 5.411 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24005, pos = { x = -146.969, y = -0.134, z = 1.736 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24006, pos = { x = -146.315, y = -0.154, z = -3.528 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24007, pos = { x = -143.588, y = -0.159, z = -6.568 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24008, pos = { x = -139.952, y = -0.160, z = -6.741 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24009, pos = { x = -135.751, y = -0.160, z = -5.368 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 2 },
	{ config_id = 24010, pos = { x = -135.118, y = -0.160, z = 4.887 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 16 },
	{ config_id = 24011, pos = { x = -134.099, y = -0.143, z = -0.049 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, tag = 16 }
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { 24012 },
		triggers = { "ENTER_REGION_24012" },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V2_2/RogueDungeon_Require"