-- 基础信息
local base_info = {
	group_id = 199002052
}

-- Trigger变量
local defs = {
	play_state = 4
}

-- DEFS_MISCS
local        defs = 
{

        --行动序列
        actions = 
        {
                {
                          [1] = { config_id = 20001, reminder_id = 1110570, point_array = 0, point_id_list = 0, duration = 20},
                },
        },


}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	[52001] = { config_id = 52001, gadget_id = 70310266, pos = { x = 583.609, y = 263.634, z = -534.700 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 401 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { },
		gadgets = { 52001 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================