-- 基础信息
local base_info = {
	group_id = 199004147
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	monsters = {
		{ config_id = 147011, monster_id = 21010401, pos = { x = -622.056, y = 123.855, z = -487.087 }, rot = { x = 0.000, y = 150.472, z = 0.000 }, level = 20, drop_tag = "远程丘丘人", pose_id = 402, area_id = 400 },
		{ config_id = 147012, monster_id = 21010401, pos = { x = -604.617, y = 123.868, z = -467.676 }, rot = { x = 0.000, y = 111.008, z = 0.000 }, level = 20, drop_tag = "远程丘丘人", pose_id = 402, area_id = 400 },
		{ config_id = 147013, monster_id = 21010401, pos = { x = -637.249, y = 123.876, z = -446.759 }, rot = { x = 0.000, y = 314.134, z = 0.000 }, level = 20, drop_tag = "远程丘丘人", pose_id = 402, area_id = 400 },
		{ config_id = 147014, monster_id = 22010201, pos = { x = -625.171, y = 126.183, z = -473.151 }, rot = { x = 0.000, y = 112.114, z = 0.000 }, level = 20, drop_tag = "深渊法师", pose_id = 9013, area_id = 400 },
		{ config_id = 147024, monster_id = 21010501, pos = { x = -623.969, y = 126.002, z = -475.867 }, rot = { x = 0.000, y = 312.903, z = 0.000 }, level = 20, drop_tag = "远程丘丘人", pose_id = 9003, area_id = 400 },
		{ config_id = 147025, monster_id = 21010501, pos = { x = -622.284, y = 126.019, z = -473.575 }, rot = { x = 0.000, y = 253.756, z = 0.000 }, level = 20, drop_tag = "远程丘丘人", pose_id = 9003, area_id = 400 }
	},
	gadgets = {
		{ config_id = 147001, gadget_id = 70950092, pos = { x = -637.427, y = 120.000, z = -446.678 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147002, gadget_id = 70950092, pos = { x = -604.535, y = 120.000, z = -467.630 }, rot = { x = 0.000, y = 305.817, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147003, gadget_id = 70950092, pos = { x = -622.313, y = 120.000, z = -487.339 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147004, gadget_id = 70290059, pos = { x = -624.888, y = 120.000, z = -472.554 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147005, gadget_id = 70290057, pos = { x = -629.101, y = 119.315, z = -495.774 }, rot = { x = 0.000, y = 30.792, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147006, gadget_id = 70290057, pos = { x = -643.531, y = 119.229, z = -471.025 }, rot = { x = 0.000, y = 254.387, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147007, gadget_id = 70290057, pos = { x = -635.274, y = 119.256, z = -431.335 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147008, gadget_id = 70290057, pos = { x = -589.685, y = 119.332, z = -463.878 }, rot = { x = 0.000, y = 83.609, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147009, gadget_id = 70290061, pos = { x = -613.533, y = 120.000, z = -444.780 }, rot = { x = 0.000, y = 49.361, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147010, gadget_id = 70290056, pos = { x = -620.899, y = 120.000, z = -453.146 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, vision_level = VisionLevelType.VISION_LEVEL_REMOTE, area_id = 400 },
		{ config_id = 147015, gadget_id = 70950087, pos = { x = -620.599, y = 120.000, z = -488.767 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147016, gadget_id = 70950087, pos = { x = -620.457, y = 120.000, z = -485.666 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147017, gadget_id = 70950087, pos = { x = -624.083, y = 120.000, z = -489.410 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147018, gadget_id = 70950087, pos = { x = -601.860, y = 120.000, z = -467.175 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147019, gadget_id = 70950087, pos = { x = -602.460, y = 120.000, z = -465.094 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147020, gadget_id = 70950087, pos = { x = -603.663, y = 120.000, z = -470.360 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147021, gadget_id = 70950087, pos = { x = -639.544, y = 120.000, z = -444.542 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147022, gadget_id = 70950087, pos = { x = -636.047, y = 120.000, z = -444.001 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 },
		{ config_id = 147023, gadget_id = 70950087, pos = { x = -638.984, y = 120.000, z = -449.603 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 20, area_id = 400 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================