-- 基础信息
local base_info = {
	group_id = 199002067
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	monsters = {
		{ config_id = 67001, monster_id = 21010101, pos = { x = 319.185, y = 121.079, z = -590.188 }, rot = { x = 0.000, y = 127.007, z = 0.000 }, level = 20, drop_tag = "丘丘人", disableWander = true, pose_id = 9003, area_id = 401 },
		{ config_id = 67006, monster_id = 21020101, pos = { x = 280.663, y = 124.727, z = -589.216 }, rot = { x = 0.000, y = 62.834, z = 0.000 }, level = 20, drop_tag = "丘丘暴徒", disableWander = true, area_id = 401 }
	},
	gadgets = {
		{ config_id = 67002, gadget_id = 70310175, pos = { x = 319.974, y = 121.473, z = -593.064 }, rot = { x = 8.858, y = 0.000, z = 0.000 }, level = 20, area_id = 401 },
		{ config_id = 67003, gadget_id = 70310175, pos = { x = 321.918, y = 121.408, z = -591.913 }, rot = { x = 0.000, y = 307.489, z = 0.000 }, level = 20, area_id = 401 },
		{ config_id = 67004, gadget_id = 70310175, pos = { x = 322.059, y = 121.228, z = -589.686 }, rot = { x = 3.343, y = 267.001, z = 0.000 }, level = 20, area_id = 401 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================